[{"kind": "plus#activity", "provider": {"title": "Community"}, "title": "I'm deeply rooted in a book by a man who was greatly used by God~ A.W. Tozer, titled \"Man-the dwelling...", "url": "https://plus.google.com/105992896676933056578/posts/AbP7KnQqzDV", "object": {"resharers": {"totalItems": 2, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13odtjhpqzczxf1t22lt5fjcvq4w5oan04/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-kEEPO4D-f48/Um0mSapJikI/AAAAAAAAOdY/oWNSm9gLXuQ/what-if-the-wounds-we-beg-god-to-heal-the.png", "width": 400, "type": "image/jpeg", "height": 295}, "url": "https://plus.google.com/photos/105992896676933056578/albums/5939445580002015793/5939445581402966594?sqi=104191988121507435081&sqsi=544704b7-5e28-4e4f-80af-1d9ce5451ef1&sqi=104191988121507435081&sqsi=544704b7-5e28-4e4f-80af-1d9ce5451ef1", "image": {"url": "https://lh3.googleusercontent.com/-kEEPO4D-f48/Um0mSapJikI/AAAAAAAAOdY/oWNSm9gLXuQ/w506-h750/what-if-the-wounds-we-beg-god-to-heal-the.png", "width": 506, "type": "image/jpeg", "height": 750}, "content": "what-if-the-wounds-we-beg-god-to-heal-the.png", "id": "105992896676933056578.5939445581402966594", "objectType": "photo"}], "url": "https://plus.google.com/105992896676933056578/posts/AbP7KnQqzDV", "content": "I&#39;m deeply rooted in a book by a man who was greatly used by God~ A.W. Tozer, titled &quot;Man-the dwelling place of God&quot;.  Through it I have learned much about God and myself. Tozer brought up three spiritual wounds we should pray to our Father in heaven for. Praying for a wound sounds to the carnal christian foolish. But those who obey the first commandment with all their heart, mind, and soul have experienced wounds so deep which led to the breaking of their destructive pride that God hates so much. Therefore, they know how necessary wounds are to a man&#39;s soul.<br /><br />The first wound Tozer said to pray for is a wound of a contrite heart.  In other words the ability to view in truth our own sinful unworthiness and natural-born impure hearts. When we sin and focus on the cross it will break our hearts ; knowing that our sins are what nailed our Savior to the cross will wound us to the point that we hate sin as God hates sin.  We can&#39;t love sin and love God.  When our Lord does His work in a man&#39;s heart He will not allow us to crave sin.  That&#39;s not to say we will never sin, but when we do it hurts and we will want to run to Jesus for forgiveness instead of hiding from Him and denying our inequities.<br /><br />The second wound is compassion for others.  Jesus tells us to mourn with those who mourn, be joyful with those who are joyful.  Christ gave us the Holy Spirit which allows Him to live on earth among us.  We are the channel for Jesus to love and suffer for others. When we pray and receive this wound of compassion our eyes, ears, mouth, and feet are God&#39;s. We develop a love and compassion that is so different from before our new birth and it feels wonderful. It is a true love; not a human emotion.  We weren&#39;t created to seek personal happiness and comfort, but for Jesus to make us holy and useful for building His Kingdom.<br /><br />Last, but certainly not least, is the wound of longing after God.  Pray to be lovesick for our Lord God as our first love.  A quote from Tozer&#39;s book, &quot;O God, that I might want Thee so badly that it becomes a wound in my heart that I can&#39;t get over.&quot;  How beautiful, the thought of loving God so much our hearts ache and we pine for more and more of Him like an addiction.  Anyone who has ever had a drug or alcohol addiction knows the high must come down which is the worst and most painful experience.  However, with God His love never crashes.  It feels better than any climatic high of any substance known to man. It&#39;s what our heart was created for.  And only God can give it.<br /><br />A lot of people decide to accept Christ and stop there while going about their superficial social christian life.  God&#39;s love is infinite and we will never know the full extent until we are with Him forever, but to be content with what we have now is silly.  The world is full of extremely educated theologians and people who know the Bible so deeply it boggles my mind, but to have a restless thirst for more God is sadly lacking. The proof is in how we treat others and how we view sin.<br /><br />God loves to be longed for and sought after.  He created our minds, bodies, and souls for this love experience with Him.  It&#39;s not until we obey the first Commandment that we can truly obey the second Commandment.  When we go out of divine order divine intervention can not happen. God promises to ask according to His will and it will be given. I believe these 3 wounds are God&#39;s will for all men and just imagine what the world would be like if all men were to ask for and receive of them. Maybe that&#39;s what heaven will be like...", "plusoners": {"totalItems": 11, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13odtjhpqzczxf1t22lt5fjcvq4w5oan04/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13odtjhpqzczxf1t22lt5fjcvq4w5oan04/comments"}, "objectType": "note"}, "updated": "2013-10-27T14:44:02.000Z", "actor": {"url": "https://plus.google.com/105992896676933056578", "image": {"url": "https://lh3.googleusercontent.com/-anh9KQY6BTE/AAAAAAAAAAI/AAAAAAAAALU/3eDlwmm5hAE/photo.jpg?sz=50"}, "displayName": "lara stang", "id": "105992896676933056578"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Jesus Christ Daily (Discussion)"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/MrW8o_RuUZq-gqQe9gZ5BYlI-3M\"", "published": "2013-10-27T14:42:25.840Z", "id": "z13odtjhpqzczxf1t22lt5fjcvq4w5oan04"}, "NONE"]