[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "Here are some tricks shaytan uses to convince a Muslimah to chat with boys:\n1)shaytan says: “Young girl...", "url": "https://plus.google.com/102104976719511381729/posts/TCRJBXaQST8", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13fxvkain3mvtnww04chn3ijtnfuf0bgc4/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-qp7dmIkSA-I/Uj5JW_jS1tI/AAAAAAAAmzM/S05_j-KUXn0/1000956_639881849377209_872650805_n.jpg", "width": 480, "type": "image/jpeg", "height": 312}, "url": "https://plus.google.com/photos/113469650417351990876/albums/5926254814511280305/5926254819031570130?authkey=CKm9g-fjgtfDAw", "image": {"url": "https://lh5.googleusercontent.com/-qp7dmIkSA-I/Uj5JW_jS1tI/AAAAAAAAmzM/S05_j-KUXn0/w506-h750/1000956_639881849377209_872650805_n.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "113469650417351990876.5926254819031570130", "objectType": "photo"}], "url": "https://plus.google.com/113469650417351990876/posts/S5rpY6RzhEX", "actor": {"url": "https://plus.google.com/113469650417351990876", "image": {"url": "https://lh5.googleusercontent.com/-fMsGTnfhF-U/AAAAAAAAAAI/AAAAAAAAl4s/6A4Tt1VLbKA/photo.jpg?sz=50"}, "displayName": "naveed ashraf", "id": "113469650417351990876"}, "content": "Here are some tricks shaytan uses to convince a Muslimah to chat with boys:<br />1)shaytan says: “Young girl, in our modern age, every girl chat with boys! Don’t be so conservative dear! We are not in the middle age anymore!”<br /><br />* Dear sister, don’t listen to shaytan! To chat/to sit with a non Mahram is Haram in Islam! Allah (subhanahu wa ta’ala) has put limits even in the relationship between a man and his own fiancé (he can talk to her only in the presence of her Mahram) so do you think HE would permit to a Muslim girl to be alone with a stranger man?! If that became so familiar, does that mean is the right thing to do? If the majority of Ummah drink Alcohol (for example) does that mean that other Muslims should drink it too? Of course not! A scholar said once:“Take the way of the righteous, do not be fooled by the lack of its followers…And be aware of the path of misguidance, do not be fooled by the high numbers of the lost ones who followed it&quot;<br /><br />2)shaytan says: “Please tell me! If you don’t chat with boys, how can you find a husband? How can you meet your charming prince?!”<br /><br />* This is one of the famous shaytan’s tricks! Dear Muslimah, When you were still a baby in your mother&#39;s womb, Allah has decreed for you your provision (your rizq is already recorded for you). Marriage is a kind of rizq that comes from Allah.. That means that your spouse name is already written for you even before you come to this Dunya. And Allah would test you whether you would take your rizq, through Halal or Haram ways.<br /><br />3) shaytan says: “This is boy is just like a brother to you! So why don’t you chat with him?”<br /><br />* Brother?!! Did your mother give him birth?!!Dear sister, plz beware of feeling safe from the tricks of shaytan. Beware of trusting your own feelings, thinking that you don’t feel anything for this boy and that it’s ok to talk to him..Remember what shaytan is always the third of you and he will surely drag you to do things you’ve never thought you would do! A wise man said: I do not know of any truth that resembles falsehood or any falsehood that resembles truth more than love. Jokes concerning it are serious, serious talk concerning it is a joke. It starts as a game and ends in ruin. <br /><br />4) shaytan says: “Dear, look how pious this Muslim brother is! why don’t you give him a chance to talk to you so you can benefit from his Islamic knowledge?”<br /><br />* This trick works with many sisters, especially the pious ones! The shaytaan deceives people and opens the way that leads them to sin. He mixes things that are acceptable with things that are not acceptable, and mixes truth with falsehood. He comes to each person through something that is suited to him. So, for pious sisters, he would come to them with &quot;religious&quot; arguments! shaytan will make sure that the woman who loves Islam and is religiously committed, will be attracted to pious men, just like her<br />If a sister wants to know more about Islam, she should have friendship with righteous sisters who can help her in increasing her Islamic knowledge and not have chat with a brother for that reason, isn&#39;t?<br /><br />Remember dear sister, with shaytan, there is always a trick for everything! Don&#39;t let him deceive you and beautify sins in your eyes so that you commit them with no regret or guilt .. Beat him! He is weak so be a strong Muslim <br /><br />★ [ DON,T FORGET TO SHARE ] ", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13fxvkain3mvtnww04chn3ijtnfuf0bgc4/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13fxvkain3mvtnww04chn3ijtnfuf0bgc4/comments"}, "id": "z13wipzrfluyhdywp04cjpd42vvbddzxqao", "objectType": "activity"}, "updated": "2013-11-02T08:33:40.805Z", "actor": {"url": "https://plus.google.com/102104976719511381729", "image": {"url": "https://lh6.googleusercontent.com/-XMkJjiblRbE/AAAAAAAAAAI/AAAAAAAAEw0/18lLE9YAj4M/photo.jpg?sz=50"}, "displayName": "Fareed Shamsi", "id": "102104976719511381729"}, "annotation": "Heart-felt thanks,Janab Naveed Sahib,whatever U have written ought to impress all true followers and not who have gone astray.The Holy Prophet(PBUH) also discouraged meeting of a boy and a girl in private.We have forgotten all Quran and Hadidh but are still ready to face ALLAH&#39;s curse in many forms,because of our inferiority complex we wish to become American.See,our daughters and sisters wearing jeans and upper.Is it Islamic to show our body which attracts males who go out of control to rape girls.whatever law is enacted,no one can earth can stop rape as its human nature.Only and only Islamic law can save honour and dignity of all women/girls.", "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/lBfPnHQiTdzTwj8CaubMpjsVbUA\"", "published": "2013-11-02T08:33:40.805Z", "id": "z13fxvkain3mvtnww04chn3ijtnfuf0bgc4"}, "NONE"]