[{"kind": "plus#activity", "provider": {"title": "Mobile"}, "title": "Mat 6:19-21\n19 \"Do not store up for yourselves wealth here on earth, where moths and rust destroy, and...", "url": "https://plus.google.com/109115107796363506099/posts/EggMJo6rE96", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12kvznxzm25jjtul235hn0xlrf5cbtj104/people/resharers"}, "attachments": [{"displayName": "Mat 6:19-21\n19 \"Do not store up for yourselves wealth here on earth, where moths and rust destroy, and burglars break in and steal.\n20 Instead, store up for yourselves wealth in heaven, where neither moth nor rust destroys, and burglars do not break in or steal.\n21 For where your wealth is, there your heart will be also.\n(CJB)\n\nWhat is the purpose of your faith in this life? Are you led to believe that to gather nice things shows God favors you? Do you believe to have possessions like that of your neighbor is confirmation of being blessed? Yeshua-Jesus tells us to build our treasure in heaven where no one can take it away and we can't lose it. That treasure however is not possessions or wealth, it is the eternal relationship, the strong bond between Yahweh and you whom He has called. No one can measure it's value. No one can steal it. Yeshua-Jesus preached contentment in this life through faith and obedience. Those principles provide the foundation for all the blessings bestowed in the Bible. The person living a Holy life must strive to show the kingdom of heaven dwelling in them. That is only revealed through faithful obedience and joyful satisfaction in knowing the Holy God of all creation. Nothing man made or any person can equal the true wealth of knowing Yahweh, and walking in the footsteps He left for His people through The Messiah, Yeshua-Jesus Christ. So ask yourself today, what is the purpose behind your faith. Are you looking to God to make you a great gatherer here? Or are you looking to God for love, peace, joy, and contentment in knowing and trusting Him? Blessings.\n\n\nPrayer:\nHoly Father it is the season were we go out to gather things to give to show our love and appreciation for those in our family and for those we call friend. Help us through Your Holy Spirit to not be caught up in the race to gather just to gather. Lead us, Your people, instead to be content and thankful for what we have. May we be blessed by Your favor to show the Kingdom of Heaven in our hearts to those seeking to know You, for that is truly the greatest gift we can give. In the name of Yeshua-Jesus who saved me at the Cross I pray. Amen.", "fullImage": {"url": "https://lh4.googleusercontent.com/-gDLxk_-SMzc/Unzoa0zg-GI/AAAAAAAAMY4/794EphFzNbQ/w640-h480/13%2B-%2B1", "width": 640, "type": "image/jpeg", "height": 480}, "url": "https://plus.google.com/photos/109115107796363506099/albums/5943881159664026561/5943881155771168866", "image": {"url": "https://lh4.googleusercontent.com/-gDLxk_-SMzc/Unzoa0zg-GI/AAAAAAAAMY4/794EphFzNbQ/w506-h750/13%2B-%2B1", "width": 506, "type": "image/jpeg", "height": 750}, "content": "11/8/13 - 1", "id": "109115107796363506099.5943881155771168866", "objectType": "photo"}], "url": "https://plus.google.com/109115107796363506099/posts/EggMJo6rE96", "content": "Mat 6:19-21<br />19 &quot;Do not store up for yourselves wealth here on earth, where moths and rust destroy, and burglars break in and steal. <br />20 Instead, store up for yourselves wealth in heaven, where neither moth nor rust destroys, and burglars do not break in or steal. <br />21 For where your wealth is, there your heart will be also.<br />(CJB)<br /><br />What is the purpose of your faith in this  life? Are you led to believe that to gather nice things shows God favors you? Do you believe to have possessions like that of your neighbor is confirmation of being blessed? Yeshua-Jesus tells us to build our treasure in heaven where no one can take it away and we can&#39;t  lose it.  That treasure however is not possessions or wealth, it is the eternal relationship, the strong bond between Yahweh and you whom He has called.  No one can measure it&#39;s value.  No one can steal it.  Yeshua-Jesus preached contentment in this life through faith and obedience.  Those principles provide the foundation for all the blessings bestowed in the Bible.  The person living a Holy life must strive to show the kingdom of heaven dwelling in them.  That is only revealed through faithful obedience and joyful satisfaction in knowing the Holy God of all creation.  Nothing man made or any person can equal the true wealth of knowing Yahweh, and walking in the footsteps He left for His people through The Messiah, Yeshua-Jesus Christ.  So ask yourself today, what is the purpose behind your faith. Are you looking to God to make you a great gatherer here? Or are you looking to God for love, peace, joy, and contentment in knowing and trusting Him?  Blessings.  <br /><br /><br />Prayer:<br />Holy Father it is the season were we go out to gather things to give to show our love and  appreciation for those in our family and for those we call friend.  Help us through Your Holy Spirit to not be caught up in the race to gather just to gather.  Lead us, Your people, instead to be content and thankful for what we have. May we be blessed by Your favor to show the Kingdom of Heaven in our hearts to those seeking to know You, for that is truly the greatest gift we can give.  In the name of Yeshua-Jesus who saved me at the Cross I pray.  Amen.  ", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12kvznxzm25jjtul235hn0xlrf5cbtj104/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12kvznxzm25jjtul235hn0xlrf5cbtj104/comments"}, "objectType": "note"}, "updated": "2013-11-08T13:34:36.903Z", "actor": {"url": "https://plus.google.com/109115107796363506099", "image": {"url": "https://lh6.googleusercontent.com/-MNLdMbESj2U/AAAAAAAAAAI/AAAAAAAAA5k/aq3nWpn5a9w/photo.jpg?sz=50"}, "displayName": "Michael Mckitric", "id": "109115107796363506099"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/iCY_URLqfWxP44XgCfIqYMc2ndM\"", "published": "2013-11-08T13:34:36.903Z", "id": "z12kvznxzm25jjtul235hn0xlrf5cbtj104"}, "NONE"]