[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "It's nobody's favorite time when our faith stands trial or when we are all but forced into trusting ...", "url": "https://plus.google.com/101527682717010275827/posts/6EJQhMM9Rik", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13exttbpk3gifccz23xy1sbxpi0yxmfr/people/resharers"}, "attachments": [{"displayName": "It's nobody's favorite time when our faith stands trial or when we are all but forced into trusting in God. It's hard to see the light at the end of the tunnel and know that God is there with an answer. The word says to \"count it all joy\" when our faith is tested. A tough time to relate to joy no doubt but it follows by emphatically urging that if we lack the wisdom to sort things out that we ask our all knowing savior to provide they way by faith. If we don't ask we won't receive and shouldn't expect to receive. It also promises that at the conclusion of our testing that we will find a stronger bond, desire and faith in God than we had before.\nJames 1:2-7 (ESV) reads \"Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness. And let steadfastness have its full effect, that you may be perfect and complete, lacking in nothing. If any of you lacks wisdom, let him ask God, who gives generously to all without reproach, and it will be given him. But let him ask in faith, with no doubting, for the one who doubts is like a wave of the sea that is driven and tossed by the wind. For that person must not suppose that he will receive anything from the Lord;\"", "fullImage": {"url": "https://lh4.googleusercontent.com/-abVxaq_tLhQ/Unx67DwHU9I/AAAAAAAAELM/z_1yvJx7ew0/w640-h426/IMG_0089.JPG", "width": 640, "type": "image/jpeg", "height": 426}, "url": "https://plus.google.com/photos/101527682717010275827/albums/5943760763945179953/5943760763260195794", "image": {"url": "https://lh4.googleusercontent.com/-abVxaq_tLhQ/Unx67DwHU9I/AAAAAAAAELM/z_1yvJx7ew0/w506-h750/IMG_0089.JPG", "width": 506, "type": "image/jpeg", "height": 750}, "content": "IMG_0089.JPG", "id": "101527682717010275827.5943760763260195794", "objectType": "photo"}], "url": "https://plus.google.com/101527682717010275827/posts/6EJQhMM9Rik", "content": "It&#39;s nobody&#39;s favorite time when our faith stands trial or when we are all but forced into trusting in God.  It&#39;s hard to see the light at the end of the tunnel and know that God is there with an answer.  The word says to &quot;count it all joy&quot; when our faith is tested.  A tough time to relate to joy no doubt but it follows by emphatically urging that if we lack the wisdom to sort things out that we ask our all knowing savior to provide they way by faith. If we don&#39;t ask we won&#39;t receive and shouldn&#39;t expect to receive. It also promises that at the conclusion of our testing that we will find a stronger bond, desire and faith in God than we had before. <br />James 1:2-7 (ESV) reads &quot;Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness. And let steadfastness have its full effect, that you may be perfect and complete, lacking in nothing.  If any of you lacks wisdom, let him ask God, who gives generously to all without reproach, and it will be given him.  But let him ask in faith, with no doubting, for the one who doubts is like a wave of the sea that is driven and tossed by the wind.  For that person must not suppose that he will receive anything from the Lord;&quot;", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13exttbpk3gifccz23xy1sbxpi0yxmfr/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13exttbpk3gifccz23xy1sbxpi0yxmfr/comments"}, "objectType": "note"}, "updated": "2013-11-08T05:47:25.477Z", "actor": {"url": "https://plus.google.com/101527682717010275827", "image": {"url": "https://lh3.googleusercontent.com/-48ABSxVxgYw/AAAAAAAAAAI/AAAAAAAADns/oBVhvE19N5U/photo.jpg?sz=50"}, "displayName": "Matthew Tebussek", "id": "101527682717010275827"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/QGPbhYeHCNzQG32Wz7c9RpUcbOk\"", "published": "2013-11-08T05:47:25.477Z", "id": "z13exttbpk3gifccz23xy1sbxpi0yxmfr"}, "NONE"]