[{"kind": "plus#activity", "provider": {"title": "Community"}, "title": "He Cares For You!\n\ncasting all your care upon Him, for He cares for you. 1 Peter 5:7\n\nYears ago as a...", "url": "https://plus.google.com/100327997934214585965/posts/cBM3b1USWer", "object": {"resharers": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12zwbpiuxnxhfeam04ccvarbsquedxad50/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-wNrE69fvah0/UnmZTWjiVPI/AAAAAAAAswo/QCPr2tmcXt4/w2000-h1500/AC.jpg", "width": 2000, "type": "image/jpeg", "height": 1500}, "url": "https://plus.google.com/photos/100327997934214585965/albums/5942949738918109329/5942949741043274994?sqi=117961471765842828011&sqsi=783300db-7d40-4c3d-bfab-ed62c43e6c00", "image": {"url": "https://lh5.googleusercontent.com/-wNrE69fvah0/UnmZTWjiVPI/AAAAAAAAswo/QCPr2tmcXt4/w506-h750/AC.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "AC.jpg", "id": "100327997934214585965.5942949741043274994", "objectType": "photo"}], "url": "https://plus.google.com/100327997934214585965/posts/cBM3b1USWer", "content": "<br />He Cares For You!<br /><br />casting all your care upon Him, for He cares for you. 1 Peter 5:7<br /><br />Years ago as a young man I was driving my car and was troubled about many things and the Lord spoke to me clearly in my spirit and told me to cast all my cares upon Him because He cares for me. Over the years He has proved His faithfulness by healing me on numerous occasions and meeting and supplying different needs just as He has promised:<br /><br />And my God shall supply all your need according to His riches in glory by Christ Jesus. Phillipians 4:19<br /><br />Yes God not heals only the physical ailments and saves the people but He turns our deficiency into sufficiency and longs to meet all our needs.  He is still the great miracle worker who died for us and sent back the Holy Spirit, another helper, to be to us all that Jesus was to His disciples.  Yes, He can and does remove our poverty permanently and makes us blessed and to be a blessing. He has come into our hearts and wiped away our all tears to dwell with us permanently. He has promised He would never leave us comfortless. He is Jehovah, our provider and our comforter.  He will fulfill our longings and desires at His appointed time and turn all our tears into joy as promised.  He will give us miracles just like He gave His friends miracles:<br /><br />So it was, as the multitude pressed about Him to hear the word of God, that He stood by the Lake of Gennesaret,  and saw two boats standing by the lake; but the fishermen had gone from them and were washing their nets.  Then He got into one of the boats, which was Simon&#39;s, and asked him to put out a little from the land. And He sat down and taught the multitudes from the boat. When He had stopped speaking, He said to Simon, &quot;Launch out into the deep and let down your nets for a catch.&quot;<br /><br />But Simon answered and said to Him, &quot;Master, we have toiled all night and caught nothing; nevertheless at Your word I will let down the net.&quot;  And when they had done this, they caught a great number of fish, and their net was breaking. So they signaled to their partners in the other boat to come and help them. And they came and filled both the boats, so that they began to sink. Luke 5:1-7<br /><br />Yes, scriptures show us clearly that Lord Jesus Christ is the remover of our needs. He went to the shore and got into Simon Peter&#39;s boat and preached the good news to the people. Though Simon Peter toiled all night, he caught nothing. So, he was totally broken hearted. After He stopped preaching, He looked at Peter and said, &quot;Launch out into the deep and let down your nets for a catch.&quot; Peter obeyed His words and let down the net and caught a great number of fish. And the Lord did this on another occasion for Peter. The bible records for our profit and enjoyment:<br /><br />After these things Jesus showed Himself again to the disciples at the Sea of Tiberias, and in this way He showed Himself: 2 Simon Peter, Thomas called the Twin, Nathanael of Cana in Galilee, the sons of Zebedee, and two others of His disciples were together.  Simon Peter said to them, &quot;I am going fishing.&quot; They said to him, &quot;We are going with you also.&quot; They went out and immediately got into the boat, and that night they caught nothing.<br /><br />But when the morning had now come, Jesus stood on the shore; yet the disciples did not know that it was Jesus.  Then Jesus said to them, &quot;Children, have you any food?&quot; They answered Him, &quot;No.&quot;  And He said to them, &quot;Cast the net on the right side of the boat, and you will find some.&quot; So they cast, and now they were not able to draw it in because of the multitude of fish. John 21:1-6<br /><br />This time Peter didn’t debate with the Lord but he cast the net on the right side of the boat, and Peter and his friends were not able to draw it in because of the multitude of fish. And Jesus stands ready today to give His miracles to His friends and to those who are broken hearted and heavy laden. His word is unchanging:<br /><br />&quot;Come to Me, all you who labor and are heavy laden, and I will give you rest.  &quot;Take My yoke upon you and learn from Me, for I am gentle and lowly in heart, and you will find rest for your souls.  &quot;For My yoke is easy and My burden is light.&quot; Matthew 11:28-30<br /><br />Yes, the Lord will perform mighty miracles for His trusting ones just like He did for the children of Israel in Egypt whom He delivered miraculously with signs and wonders from their oppressors and spoiled them with the wealth of Egypt as He is no respecter of persons and shows partiality to no one. His word is true:<br /><br />Moreover God said to Moses, &quot;Thus you shall say to the children of Israel: &#39;The LORD God of your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, has sent me to you. This is My name forever, and this is My memorial to all generations.&#39;  &quot;Go and gather the elders of Israel together, and say to them, &#39;The LORD God of your fathers, the God of Abraham, of Isaac, and of Jacob, appeared to me, saying, &quot;I have surely visited you and seen what is done to you in Egypt;  &quot;and I have said I will bring you up out of the affliction of Egypt to the land of the Canaanites and the Hittites and the Amorites and the Perizzites and the Hivites and the Jebusites, to a land flowing with milk and honey.&quot; &#39;<br /><br />&quot;Then they will heed your voice; and you shall come, you and the elders of Israel, to the king of Egypt; and you shall say to him, &#39;The LORD God of the Hebrews has met with us; and now, please, let us go three days&#39; journey into the wilderness, that we may sacrifice to the LORD our God.&#39;  &quot;But I am sure that the king of Egypt will not let you go, no, not even by a mighty hand.  &quot;So I will stretch out My hand and strike Egypt with all My wonders which I will do in its midst; and after that he will let you go.  &quot;And I will give this people favor in the sight of the Egyptians; and it shall be, when you go, that you shall not go empty-handed.  &quot;But every woman shall ask of her neighbor, namely, of her who dwells near her house, articles of silver, articles of gold, and clothing; and you shall put them on your sons and on your daughters. So you shall plunder the Egyptians.&quot; Exodus 3:15-22<br /><br />Yes, the Lord is the shield, defender, reward, provider and avenger of His trusting ones.  He is not a respecter of persons and shows partiality to no one. What He has done for one He will do for another, even for churches. A lot of churches today are like patients on life-support. The Spirit is long gone, but the body is kept alive by artificial means. Many churches have got the form of religion but have lost the power of resurrection. People come to God&#39;s house only to find that God isn&#39;t home. God&#39;s house has become a museum, set up to glorify where God used to be. If ever there were a need for Revival, it is most certainly now.<br /><br />Indeed, there is a renewal movement on the rise. With infinite wisdom and mercy, God is sending a fresh wind of the Spirit to breathe new life into the church. Some churches respond by adding insulation to keep the wind out. Some feel the wind but don&#39;t know what it is. And some open their doors and windows gladly and said, &quot;Come, Holy Spirit, we need you.&quot; God’s word is unchanging:<br /><br />&quot;Now on the last day, the great day of the feast, Jesus stood and cried out, saying, &quot;If anyone is thirsty, let him come to Me and drink. He who believes in Me, as the Scripture said, &#39;From his innermost being will flow rivers of living water.&#39;&quot; But this He spoke of the Spirit, whom those who believed in Him were to receive...&quot; (John 7:37-39).<br /><br />This promise is for all us! It is totally realistic for us to &quot;come and drink.&quot; We can experience God as intensely as Jesus promised! We can learn to come and drink and we can experience the Holy Spirit flowing through us, continually. God will do His part. Some things will need to change with we, but we can do it.  We need to learn why we can &quot;come to Him.&quot; We need to learn why we can &quot;drink.&quot; We will also have to come to the place where we believe His glory &quot;as the scriptures said.&quot;<br /><br />Quenching our thirst with God requires faith in His grace that He will come to us without His holding back. If we don&#39;t believe we won&#39;t be free to receive (Gal. 3:14; Rom. 4:16). This principle of our needing to believe is true of us individually. It is also true of us as the body of Christ. Many Christians believe that God wants to give us a great outpouring of His presence. We will not receive the out-pouring for which we long until we as the body of Christ have the faith to receive it. Likewise, we will not have faith to receive His presence, until we believe it is right. God’s word is just as great no matter where one goes to church. The problem is our disbelief. Our theology, and our application of scripture, must align with receiving a flow of the Holy Spirit through us continually. God is waiting for us.    Whether God comes to us as a sprinkling, rain, or something as intense as a downpour we have to believe He will come &quot;in full assurance of faith,&quot; without hesitation (Heb. 10:19,22). If we don&#39;t believe what the scriptures say, He won&#39;t be able to come to us as He desires. Many Christians know that without faith it is impossible to please God. But many have missed what the second part of the verse says?<br /><br />&quot;And without faith it is impossible to please Him for he who comes to God must believe that He is and that He is a rewarder of those who seek Him&quot; (Heb. 11:6).<br /><br />We &quot;must believe&quot; that God will reward us with His presence when we seek Him. It is that way with wisdom from God (James 1:5-7). It is that way with His presence. It is also that way with experiencing relationship with Him. But simply knowing these things isn&#39;t enough. None of us can receive God’s presence intensely until faith comes to us by &quot;hearing&quot; the word. The need is for a better understanding of the scriptures.<br /><br />We need a theology that includes an understanding of the scriptures that make it possible for each one of us to continually receive God&#39;s presence. We need a strong biblical foundation upon which to base our faith in the grace of God.  We need repentance. Repentance should come before drawing near to God. But repentance will never be fully complete for any of us! Repentance is for drawing near to God and drinking, as soon as we are able! Repentance is for staying near to God in all His glory and drinking all the time. Even though that may sound impossible for us right now, we can do it. God is shepherding us toward this end! His word is true:<br /><br />The LORD is my shepherd; I shall not want.  He makes me to lie down in green pastures; He leads me beside the still waters. Psalm 23:1-2<br /><br /> ", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12zwbpiuxnxhfeam04ccvarbsquedxad50/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12zwbpiuxnxhfeam04ccvarbsquedxad50/comments"}, "objectType": "note"}, "updated": "2013-11-06T01:20:17.122Z", "actor": {"url": "https://plus.google.com/100327997934214585965", "image": {"url": "https://lh6.googleusercontent.com/-gQKIUKnScFA/AAAAAAAAAAI/AAAAAAAAABg/6qs4gqPgLdE/photo.jpg?sz=50"}, "displayName": "WALT KAM", "id": "100327997934214585965"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Inspiration Daily (Discussion)"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/gMFx445S80oA27vsaCD98FpKumk\"", "published": "2013-11-06T01:20:17.122Z", "id": "z12zwbpiuxnxhfeam04ccvarbsquedxad50"}, "NONE"]