[{"kind": "plus#activity", "provider": {"title": "Community"}, "title": "Giro d'Italia 2013 Stage 3\nTHE AMALFI COAST\n\nNaples Bay rounds out any trip to Italy with an antipasto...", "url": "https://plus.google.com/101969375268872345443/posts/fYqEg483kJU", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13kujigypysjniza04cdlezqwawtpggjjc/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh6.googleusercontent.com/-fx1x6vBhnaU/UYb11maJUiI/AAAAAAAAPb4/WpGKTLCzy1Y/w288-h288/amalfi.jpg", "width": 259, "type": "image/jpeg", "height": 194}, "url": "https://plus.google.com/photos/101969375268872345443/albums/5874653059173678433/5874653065143472674?authkey=CJuLjKvNxJP96wE&sqi=108117531795339712088&sqsi=bb527bff-2e18-45d4-a045-913b48064766", "image": {"url": "https://lh6.googleusercontent.com/-fx1x6vBhnaU/UYb11maJUiI/AAAAAAAAPb4/WpGKTLCzy1Y/w506-h750/amalfi.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "amalfi.jpg", "id": "101969375268872345443.5874653065143472674", "objectType": "photo"}], "url": "https://plus.google.com/101969375268872345443/posts/fYqEg483kJU", "content": "<b>Giro d&#39;Italia 2013 Stage 3</b><br /><i>THE AMALFI COAST</i><br /><br />Naples Bay rounds out any trip to Italy with an antipasto misto of travel thrills. <b>Sorrento</b>, an hour south of Naples&#39; urban intensity, is a great home base and the gateway to the much-drooled-over Amalfi Coast. From the jet-setting island of <b>Capri</b> to the stunning Amalfi towns, from ancient <b>Pompeii</b> to even more ancient <b>Paestum</b>, this is Italy&#39;s coast with the most. <b>Naples</b> is Italy in the extreme — its best (birthplace of pizza and Sophia Loren) and its worst (home of the Camorra, Naples&#39; &quot;family&quot; of organized crime).<br /><br />On a quick trip, give the entire area — including Sorrento and Naples — a minimum of three days. With <b>Sorrento</b> as your sunny springboard spend a day in Naples, a day exploring the Amalfi Coast, and a day split between Pompeii and the town of Sorrento. While Paestum, Mount Vesuvius, Herculaneum (an ancient Roman site like Pompeii), and the island of Capri are decent options, they are worthwhile only if you give the area more time.<br />In the afternoon, Naples&#39; street life slows and many sights close as the temperature soars. The city comes back to life in the early evening.<br />Sorrento, wedged on a ledge between the mountains and the Mediterranean, is an attractive resort of 20,000 residents and — in the summer — as many tourists. It&#39;s as well-located for regional sightseeing as it is a pleasant place to stay and stroll. The Sorrentines have gone out of their way to create a completely safe and relaxed place for tourists to spend money. Everyone seems to speak fluent English and work for the Chamber of Commerce. Spritzed by lemon and olive groves, this gateway to the Amalfi Coast has an unspoiled old quarter, a lively main shopping street, a spectacular cliffside setting, and easy public transportation.<br /><br />The Amalfi Coast offers one of the world&#39;s great bus rides: The coastal trip from <b>Sorrento to Salerno</b> will leave your mouth open and your film exposed. You&#39;ll gain respect for the Italian engineers who built the road — and even more respect for the bus drivers who drive it. As you hyperventilate, notice how the Mediterranean, a sheer 500-foot drop below, twinkles.<br />Cantilevered garages, hotels, and villas cling to the vertical terrain. Beautiful sandy coves tease from far below and out of reach. Gasp from the right side of the bus as you head toward Salerno, and the left on the way back to Sorrento. Traffic is so heavy that in the summer local cars are allowed to drive only every other day: even-numbered license plates one day, odd the next. <br />The real Amalfi thrill is the scenic drive.<br />If you need a destination, consider <b>Positano</b>, an easy day trip from Sorrento. Specializing in scenery and sand, the town of Positano hangs halfway between Sorrento and <b>Amalfi</b> town on the most spectacular stretch of the coast. A three-star sight from a distance, Positano is a pleasant (if expensive) gathering of women&#39;s clothing stores and cafés, with a good but pebbly beach. There&#39;s little to do here but enjoy the beach and views and window-shop.<br /><b>Capri</b>, made famous as the vacation hideaway of Roman emperors Augustus and Tiberius, is today a world-class tourist trap where gawky tourists search for the rich and famous but find only their prices. A quick boat ride from Sorrento, this four-mile-by-two-mile &quot;Island of Dreams&quot; is a zoo in July and August. Other times of year it provides a relaxing and scenic break from the cultural gauntlet of Italy. While Capri has some Roman ruins and an interesting 14th-century Carthusian monastery, its chief attraction is its famous Blue Grotto and its best activity is a scenic hike.<br /><br />As seen from Sorrento, <b>Mount Vesuvius</b> rises through the haze across the Bay of Naples.<br /><b>Pompeii</b>, stopped in its tracks by the eruption of Mount Vesuvius in A.D. 79, offers the best look anywhere at what life in Rome must have been like 2,000 years ago. An entire city of well-preserved ruins is yours to explore. Once a thriving commercial port of 20,000, Pompeii grew from Greek and Etruscan roots to become an important Roman city. Then Pompeii was buried under 30 feet of hot mud and volcanic ash. For archaeologists this was a shake-and-bake windfall, teaching them volumes about daily Roman life.<br /><b>Herculaneum</b> — smaller, less ruined, and less crowded than its famous sister, Pompeii — offers a closer look at ancient Roman life. Caked and baked by the same eruption in A.D. 79, Herculaneum is a small community of intact buildings with plenty of surviving detail.<br />Vesuvius, mainland Europe&#39;s only active volcano, has been sleeping restlessly since 1944. Complete your Pompeii or Herculaneum experience by scaling the volcano that made them famous. <br /><b>Paestum</b> is one of the best collections of Greek temples anywhere — and certainly the most accessible to Western Europe. Serenely situated, it&#39;s surrounded by fields and wildflowers and a modest commercial strip. <br />The Amalfi coast is included in the UNESCO World Heritage Sites.<br /><br /><i>by Rick Steves</i>", "plusoners": {"totalItems": 2, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13kujigypysjniza04cdlezqwawtpggjjc/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13kujigypysjniza04cdlezqwawtpggjjc/comments"}, "objectType": "note"}, "updated": "2013-05-06T00:18:05.124Z", "actor": {"url": "https://plus.google.com/101969375268872345443", "image": {"url": "https://lh4.googleusercontent.com/-Q4uhw7QQ4Gg/AAAAAAAAAAI/AAAAAAAAOJ4/-Y209-TVG4g/photo.jpg?sz=50"}, "displayName": "Frank Opstaele", "id": "101969375268872345443"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "PROFESSIONAL CYCLING (GIRO D'ITALIA)"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/GEJ_2HJmUmTmHZGJYqvsQVwxH8Y\"", "published": "2013-05-06T00:18:05.124Z", "id": "z13kujigypysjniza04cdlezqwawtpggjjc"}, "NONE"]