[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "At Delhi, the Guru and his four companions were summoned into the council chamber of the Lal Kila (the...", "url": "https://plus.google.com/107565328023867837450/posts/FD8Pu45u2Sx", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132zhko2sa4xjyeo223dnebsq3iypy24/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh6.googleusercontent.com/-f7LEyDmKjaA/Tszbjycq0NI/AAAAAAAACWk/f0-o6_sVssA/w288-h288/Guruteghbahadurmartyr.jpg", "width": 212, "type": "image/jpeg", "height": 197}, "url": "https://plus.google.com/photos/107565328023867837450/albums/5678154638547677521/5678154638091276498", "image": {"url": "https://lh6.googleusercontent.com/-f7LEyDmKjaA/Tszbjycq0NI/AAAAAAAACWk/f0-o6_sVssA/w506-h750/Guruteghbahadurmartyr.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "Guruteghbahadurmartyr.jpg", "id": "107565328023867837450.5678154638091276498", "objectType": "photo"}], "url": "https://plus.google.com/107565328023867837450/posts/FD8Pu45u2Sx", "content": "At Delhi, the Guru and his four companions were summoned into the council chamber of the Lal Kila (the Red Fort}. The Guru was asked numerous questions on religion, Hinduism, Sikhism and Islam. It was suggested to the Guru that he should embrace Islam. On the Guru&#39;s emphatic refusal to abjure his faith, he was asked why he was called Teg Bahadur (Brave Swordsman). Bhai Mati Das immediately replied that the Guru, then named Tyag Mal, had won the title by inflicting a heavy blow on the imperial forces at the young age of fourteen. He was reprimanded for his breach of etiquette and outspokenness. As Mati Das was a Brahmin, the Guru was asked why he had courted the company of such men when he did not believe in caste, and why he was defending the Brahmins of Kashmir. The Guru replied that when a person became a Sikh, he lost his caste. As for the Kashmiri Pandits, it was his duty to raise his voice against cruelty and injustice. The Guru and his companions were ordered to be imprisoned and tortured until they agreed to embrace Islam.After a few days, Guru Teg Bahadur and three of his companions were produced before the Qazi of the city. Gurditta had managed to escape. He remained in hiding in the city, and in spite of all the efforts of the Government, he could not be traced. The Qazi turned to Mati Das first and asked him to embrace Islam. He refused to do so. He was condemned to an instantaneous death.The executioners were called and the Guru and all the three of his companions were made to sit at the place of the execution. Bhai Mati Das approached the Guru with his palms pressed together , as he asked for his blessings, saying that he was happy to be the first to achieve martyrdom.The Guru blessed him telling that they must resign themselves cheerfully to the will of the Lord. He praised him for his lifelong single-minded devotion to him and his cause. With tears in his eyes, he bade him farewell saying his sacrifice would occupy an abiding place in history. Mati Das touched the Guru&#39;s feet, embraced his friend and brother, and came to his place.Mati Das while standing erect was tied between two posts. He was asked if he had any parting words, to which Mati Das answered, &quot;I request only that my head be turned toward my Guru as I am executed.&quot; Two executioners placed a double-handed saw on his head. Mati Das serenely uttered &quot;Ek Onkar&quot; and started reciting the Japji Sahib, the great morning prayer of the Sikhs. He was sawn in half from head to loins. It is said that even as the body was being sawn into two, the Japji continued to reverberate from each part until it was all over.Note: The Dates of events in this article have been changed in accordance with the Nanakshahi calendar and so may not be the same as in other articles.", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132zhko2sa4xjyeo223dnebsq3iypy24/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132zhko2sa4xjyeo223dnebsq3iypy24/comments"}, "objectType": "note"}, "updated": "2011-11-23T11:40:44.736Z", "actor": {"url": "https://plus.google.com/107565328023867837450", "image": {"url": "https://lh3.googleusercontent.com/-A_5-WMGkVZE/AAAAAAAAAAI/AAAAAAAASfQ/AuYuV0uipdg/photo.jpg?sz=50"}, "displayName": "Poonam Sehgal", "id": "107565328023867837450"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/J36-sRZ9CohkovUyWoTrk3Iksqs\"", "published": "2011-11-23T11:40:44.736Z", "id": "z132zhko2sa4xjyeo223dnebsq3iypy24"}, "NONE"]