[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "\"In historie's page....a land girt by sea....\"\n\nSuch a place existed and was not immune from the Germanic...", "url": "https://plus.google.com/108627083873030417683/posts/NaitSKkb7o5", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z134el04auqavl0w104chnuz3qy5szpg3e4/people/resharers"}, "attachments": [{"displayName": "The war continued with renewed fervour and those Luft Balloons now often festooned and always current with a mixture of Los Ninos and Las Ninas played host to tourists who lazily traversed their domain as they bravely withstood German barrage after barrage. It was upon an Hinden-Berg class airship that Lady V dressed for the cooler air of upper altitude hiding that dazzling auburn bouffant made the acquaintance of 'The Firm'. A sealed letter with embossed livery bearing that title and “Invitation” immediately had Lady V on the defensive, appalled and tremulous. Lawyers. Her thoughts were why The Germans, brilliant thus far had not simply employed lawyers and gotten the war over and done with such was their way rather than all of this needless effort. “The Firm' though were financiers and it was at this meeting that the reason for this strategy became apparent. Sitting adjacent from each other and enviously regarding Lady V the delegates from 'The Firm' were financiers, marketeers and on a mission to drag the world into the future. The war as it was explained was a vehicle, agreed to by both sides to this end. The issue being that, as Lady V was presented with steaming mint tea in antique china servingware, the ROI was not being achieved creating all sorts of miscalculations and additional hardships for those caught up in the war. “ROI? Lady V coolly asked noting the flavor of the tea and ordering seaweed salad for each of them off the menu. “Return On Investment” Invective, The Firm's spokesperson glibly replied. “I know the meaning, how much?” with raised eyebrows was the cutting reply of Lady V. “Ten Percent” Invective offered. “Impressive” Lady V acknowledged “Using market derivation models” Invective replied with a wink “Meaning?” Lady V asked with raised eyebrows as the seaweed salad arrived “Eighteen percent gross before appropriations, with valuation and on-costs being managed via 'uncertifieds'” Invective offered “Uncertifieds and appropriations” Lady V offered eyebrows raised yet again “Certification was applied publicly via the process of legal segregation under the Populace Classifications Bill enabling those persons deemed to be other than certain castes and classes to be 'certified', appropriations were used to deem this appropriate and then appropriately applied to apportion costs against 'uncertified' items and these costs appropriately then 'certified' for use in the ongoing war effort. Inappropriateness of course was considered and then certified as appropriate enabling uncertified transfer of inappropriate matters via appropriations increasing nett ROI by an estimated 2.3%” Invective smiled noting the seaweed salad and pouring himself a tea. “The Firm' thus concluding matters and Lady V gazing at those balloons from The Hinden-Berg noting that none of this could have been accomplished without lawyers. She had under-estimated The Germans. To assist in providing an ROI to an individual, visit www.BalboaPress.com and search for 'Going It Alone' by Russell Sullivan. The 'e'Book is available and priced to appeal, when all is said and done the author providing a litmus test to the reader, would John Donne have appreciated this. Download a copy and it is hoped the answer would be, 'Take It As Done'....", "fullImage": {"url": "https://lh4.googleusercontent.com/-5erYzKwjNpQ/UhgFOYspFOI/AAAAAAAAAKk/5hHEtWZdZvo/The+Bloom+Field+Argus.jpg", "width": 960, "type": "image/jpeg", "height": 720}, "url": "https://plus.google.com/photos/108627083873030417683/albums/5915483854912804177/5915483855257146594?authkey=CLbnnLDJxLKKpAE", "image": {"url": "https://lh4.googleusercontent.com/-5erYzKwjNpQ/UhgFOYspFOI/AAAAAAAAAKk/5hHEtWZdZvo/w506-h750/The+Bloom+Field+Argus.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "108627083873030417683.5915483855257146594", "objectType": "photo"}], "url": "https://plus.google.com/108627083873030417683/posts/NaitSKkb7o5", "content": "&quot;In historie&#39;s page....a land girt by sea....&quot;<br /><br />Such a place existed and was not immune from the Germanic fracas. Luft Balloons now Las Nina&#39;s to enable the current situation to be more accurately modelled and managed as part of an &#39;Atmos-fearic&#39; campaign, the loss of such it was worried by G W-S resulting in  &#39;Hys-Teria&#39;<br /><br />War of course needs rules, as in the high alps where the Hinden-Berg floated serenely a city known as Jar-Nee-Var (derivation of &#39;Nee&#39; meaning prior as Var was the original locale but renamed to Jar in recognition of the discovery of pottery), a set of conventions attended by those delegates delegations now in place was attended.<br /><br />A ceremony named a corroboree that enabled the attendees to dress in wigs and long gowns as would be present at a regal ball or that formal debut could be worn.<br /><br />The corroboree required corroboration and the ceremony commenced as was decided with either &#39;I Will&#39; or &#39;I Do&#39; on the book of Lore. Of interest and considered a method of enticement termed &#39;Con-Tempt&#39; much swearing was not only accommodated but required at the corroboree and those who did not dress in the formal garb were as such clad gaily and brightly when attending and swearing most agreeably.<br /><br />His-tory complete the Wind-Soars and Two-Doors understand that this struggle will be titanic and as the Hinden-Berg floated over Jar-Nee-Var reconciled themselves to the losses of war.<br /><br />The Firm of course had no such sentiments and as the promised ROI was finally reached and the algorithms for appropriation via the certifications mechanism declared publicly that they were &#39;mystified as to the reasons for war but considered it Idicy to allow social development to lapse as a result of it.&#39;<br /><br />The public were rapt and painted the town red.<br /><br /><br />John Donne, poet laureate and spurned by one very young. Please help support the war effort and The Argus buy a copy of &#39;Going IT Alone&#39; by Russell Sullivan at <a href=\"http://www.Balboapress.com\" class=\"ot-anchor\" rel=\"nofollow\">www.Balboapress.com</a> in &#39;e&#39;Book or softcopy.", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z134el04auqavl0w104chnuz3qy5szpg3e4/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z134el04auqavl0w104chnuz3qy5szpg3e4/comments"}, "objectType": "note"}, "updated": "2013-08-24T01:11:27.980Z", "actor": {"url": "https://plus.google.com/108627083873030417683", "image": {"url": "https://lh4.googleusercontent.com/-jrzZiUkCuBU/AAAAAAAAAAI/AAAAAAAAA2g/rBzYdt9HFsI/photo.jpg?sz=50"}, "displayName": "PAUONH", "id": "108627083873030417683"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/NYA2F0VrwpSeZcvbmBN85XJR7uI\"", "published": "2013-08-24T01:11:27.980Z", "id": "z134el04auqavl0w104chnuz3qy5szpg3e4"}, "NONE"]