[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "Realising impermanence and selflessness,\nbeyond mere intellectual notions…\n\nImpermanence and selflessness...", "url": "https://plus.google.com/110221110505801391351/posts/G2wydgRUYBM", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13afbv4lpnhh1w2t221yxdbvvzxjldvr/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-WsEteQlHcV0/UhXrXDUnOcI/AAAAAAAAI0Y/sSqFw7Cyh1I/Adam+Martinakis.jpeg", "width": 448, "type": "image/jpeg", "height": 640}, "url": "https://plus.google.com/photos/106651989741536097256/albums/5914892463734739921/5914892466882296258?authkey=CKOFnIXOld62qwE", "image": {"url": "https://lh5.googleusercontent.com/-WsEteQlHcV0/UhXrXDUnOcI/AAAAAAAAI0Y/sSqFw7Cyh1I/w506-h750/Adam+Martinakis.jpeg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "106651989741536097256.5914892466882296258", "objectType": "photo"}], "url": "https://plus.google.com/106651989741536097256/posts/PY9GxEbQyAP", "actor": {"url": "https://plus.google.com/106651989741536097256", "image": {"url": "https://lh4.googleusercontent.com/-HvsmbcpBbug/AAAAAAAAAAI/AAAAAAAACfY/hexRqPX1CYY/photo.jpg?sz=50"}, "displayName": "Denis Wallez", "id": "106651989741536097256"}, "content": "<b><i>Realising</i> impermanence and selflessness</b>,<br />beyond mere intellectual notions…<br /><br />Impermanence and selflessness are notions that can be &quot;hard to see&quot; or &quot;clearly visible&quot; (<a href=\"http://gplus.wallez.name/Sur3Q3p7xWs\" class=\"ot-anchor\" rel=\"nofollow\">gplus.wallez.name/Sur3Q3p7xWs</a>) depending on time, circumstances, conditions… Even when the notions are well understood (on a conventional level), their <i>embodiment</i> (on an ultimate level) might still seem far away.<br /><br />Is there anything in modern psychology that might help us grasp about <i>how</i> we still embody the ignorance of permanency, even once we accepted the past proved impermanent?<br /><br /><br /><b>The &quot;end of history&quot; illusion</b><br /><br />One statistical characterisation of this ignorance has recently been published: thousands of people (between 18 and 68 years old) were asked to report how much they had changed in the past decade and/or<br />to predict how much they would change in the next decade… in terms of personalities (occupations, habits, traits), core values and principles, and preferences (favourite type of music, of vacation, of food, favourite hobby, and the name of one&#39;s best friend).<br /><br />Young people, middle-aged people <i>and</i> older people all believed that they had changed a lot in the past, but would change relatively little in the future!<br /><br /><br />It seems most people believe that, overall, their current personalities are attractive (even if under-appreciated), their current values admirable, and their current preferences wise.<br />Having supposedly reached such a high state of being, change doesn&#39;t appeal much; denial of impermanence is tempting.<br /><br />People also like to believe that they know themselves well (&quot;by now&quot;, while happily admitting they didn&#39;t in the past, even the recent past…), and the possibility of future change may threaten this belief.<br /><br />People are motivated to think well of themselves (and a lot of &quot;self-help&quot; is based on cultivating such thoughts) and to feel secure in this understanding (anxiety is rarely seen in a positive light… rarely as a healthy state of wisdom): the &quot;end of history&quot; illusion may help to cling to a highly-valued permanent &#39;self&#39;.<br /><br /><br />It also seems there is at least one important difference between looking forward and looking backward in time.<br /><br />Prospection is a constructive process, retrospection is a reconstructive process, and constructing new things is typically more difficult.<br />Our human condition includes a brain strong at pattern-matching. As people find it difficult to imagine the specific ways in which they will change in the future (due to the lack of a model/pattern to match), they easily assume that such changes are unlikely. In short, people may confuse the difficulty of imagining changes with their unlikelihood!<br /><br /><br />People tend to regard the present as the time when they have <i>finally</i> become the person they will be for the rest of their lives.<br /><br /><br /><b>What to do?</b><br /><br />An antidote to perceiving one&#39;s personality as attractive, one&#39;s values admirable, and one&#39;s preferences wise would be <b>humility</b>. There is a difference between appreciation of what one has achieved (including in terms of &#39;purification&#39;) and arrogance.<br />If, from past progress, one can build faith in one&#39;s abilities without denying one&#39;s remaining weaker points, future change can be confidently welcome.<br /><br />An antidote to the reification of oneself (knowing oneself &#39;well&#39;) is<br /><b>&quot;not knowing&quot;</b>. Stay interested in who you&#39;re becoming! Pay attention to changes. Subtle variations may make a lot of difference (e.g. when &#39;cooking&#39;) and they usually distinguish the true master from the bookish parrot. The antidote is to stay tuned in your emerging mastery!<br /><br />An antidote to regarding the present as the time when you have <i>finally</i> become the person you will be for the rest of your life is in shifting from a view of certainty to a view of <b>appreciation</b>. It is not in denying the current results of your journey so far… Appreciation is distinct from fixating things: you may appreciate the love of people around you, but projecting a certainty on it leads to complacency and taking it for granted! Similarly, you can appreciate your current life, but taking it for granted is unhelpful.<br /><br />An antidote to the pattern-matching dilemma is the famous <b>cessation of ignorance</b> of Buddhism: acknowledging that patterns do emerge, and have utility, but that they do not hold the predictive powers and certainties we project on them. This antidote sometimes manifests as a long journey to travel (gradual cultivation), sometimes in a flash (sudden insight)… Don&#39;t presume you know how or when you&#39;ll reach the goal of holy life.<br />Try to stay mindful of how you use patterns (every day, all day long): the best patterns are examples of &quot;conventional truth&quot; while the mindful awareness of their limitations (contextual-ness) is an example of &quot;ultimate truth&quot;. Every time you hold awareness of both, you&#39;re dropping the veils that seemed separating you from your buddha-nature.<br /><br /><br /> <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23Buddhism\">#Buddhism</a>   <br />image: © <span class=\"proflinkWrapper\"><span class=\"proflinkPrefix\">+</span><a href=\"https://plus.google.com/102924130113610853494\" class=\"proflink\" oid=\"102924130113610853494\">Adam Martinakis</a></span>, 2013<br />study: <a href=\"http://www.wjh.harvard.edu/~dtg/Quoidbach%20et%20al%202013.pdf\" class=\"ot-anchor\" rel=\"nofollow\">www.wjh.harvard.edu/~dtg/Quoidbach%20et%20al%202013.pdf</a>", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13afbv4lpnhh1w2t221yxdbvvzxjldvr/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13afbv4lpnhh1w2t221yxdbvvzxjldvr/comments"}, "id": "z12ghlo5uneihfroa04chb3xjkr0fxfaalc0k", "objectType": "activity"}, "updated": "2013-08-23T06:44:55.093Z", "actor": {"url": "https://plus.google.com/110221110505801391351", "image": {"url": "https://lh6.googleusercontent.com/-cTL3Ghvcx_c/AAAAAAAAAAI/AAAAAAAAP48/RuHGaDe1TpQ/photo.jpg?sz=50"}, "displayName": "Camille Key", "id": "110221110505801391351"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/8Xhr53JSmswaPFzdw_08SnvBGqY\"", "published": "2013-08-23T06:44:55.093Z", "id": "z13afbv4lpnhh1w2t221yxdbvvzxjldvr"}, "NONE"]