[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "Some Thoughts And Information About Auto-Sharing Plussed Posts\n\nThere's been a lot of talk in the past...", "url": "https://plus.google.com/108406755709472416416/posts/bCqZFmxLhK1", "object": {"resharers": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12igt3q0tyysrjyg04cghgrhpmcchsorek/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/--QR300FgVh4/Ud2CAcuIdTI/AAAAAAAAQ28/4KVtN0X2Noc/s0-d/Plusses.JPG", "width": 759, "type": "image/jpeg", "height": 391}, "url": "https://plus.google.com/photos/109043804130056015419/albums/5899014030379077617/5899014031146513714?authkey=CM_jkvv_3brCzgE", "image": {"url": "https://lh3.googleusercontent.com/--QR300FgVh4/Ud2CAcuIdTI/AAAAAAAAQ28/4KVtN0X2Noc/w506-h750/Plusses.JPG", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "109043804130056015419.5899014031146513714", "objectType": "photo"}], "url": "https://plus.google.com/109043804130056015419/posts/45W1TvMTuG5", "actor": {"url": "https://plus.google.com/109043804130056015419", "image": {"url": "https://lh6.googleusercontent.com/-E8x7SZwxVEI/AAAAAAAAAAI/AAAAAAAANr0/aufj_H8BpKc/photo.jpg?sz=50"}, "displayName": "Michael O'Reilly", "id": "109043804130056015419"}, "content": "<b>Some Thoughts And Information About Auto-Sharing Plussed Posts</b><br /><br />There&#39;s been a lot of talk in the past day or so about the new Google+ mechanism of placing posts in your Stream that were plussed by people you have circled. I thought I&#39;d summarize parts of it and offer some thoughts and suggestions.<br /><br />First of all, what are we talking about? The feature implemented is a system by which if someone you have circled plusses a post, Google+ will sometimes put that post in your Stream, even if you don&#39;t have the author circled. I believe that Google&#39;s intent here is to try and bring content to our attention that would interest us and that we otherwise might have missed. I think it&#39;s an admirable goal that will be improved upon along the way, but that the step as initially implemented has a couple of significant flaws. The most obvious flaw is that there is currently no way to turn off receiving these posts in the main Stream. I feel that the biggest part of the controversy would be alleviated by simply giving people the option of turning it off, or better yet making it an opt-in system that people could choose to turn on.<br /><br />Since that option does not exist, and since it <i>is</i> possible to turn off the feature from the sending end, I have chosen to do that. In case you are interested in turning it off so that you don&#39;t feel like you&#39;re spamming people, you can simply click on <a href=\"https://plus.google.com/u/0/apps/google\" class=\"ot-anchor\" rel=\"nofollow\">https://plus.google.com/u/0/apps/google</a> and choose who will see your plus-one activity. (I attached a picture of the dialog below.) Setting it to &quot;Only you&quot; will get it to stop sending out the posts you plus to anyone in your circles. Setting to &quot;Public&quot; means the posts can go to anyone who has you circled, &quot;Your circles&quot; means anyone who has you circled who you also have circled, and &quot;Extended circles&quot; means anyone who has you circled who is either part of your circles or who is circled by anyone in your circles. Whew, it&#39;s a little confusing, but hopefully not too bad.<br /><br />I think the core problem is that there are multiple reasons people plus a post. If the plus always meant &quot;Wow! That&#39;s a great post and I love it!&quot; then the new system might be a decent first stab at helping you to find content you&#39;d like based on what the people you have circled like. However, that&#39;s not always, or even most of the time, the meaning. I often use a plus-one along the lines of &quot;I have read your post and am acknowledging that fact to you, the author, but I don&#39;t find the post so inspiring that I feel the need to comment on it.&quot; In the case of that meaning, the new system is going to find potentially so-so posts to share with people who have me circled, where it would get much better results if it shared out the posts I&#39;m commenting on instead.<br /><br />I like the direction that Google appears to want to go with this. I want them to be able to find content that will interest me and present it to me, even if I didn&#39;t know enough to find it myself. Unfortunately I think this step along that path brings too much noise along with the signal based on the current implementation. I have faith that the developers will continue to improve things, and that down the road my Stream will always be full of exactly the things I would find most interesting to read. In the meantime, if we all provide feedback on what we do and don&#39;t like about the system it will help them get there.<br /><br />Please let me know if I&#39;ve missed any details, or if you have a completely different take on the issue.", "plusoners": {"totalItems": 5, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12igt3q0tyysrjyg04cghgrhpmcchsorek/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12igt3q0tyysrjyg04cghgrhpmcchsorek/comments"}, "id": "z12phbcrlszftdgsm22kgfubglmegjw4d04", "objectType": "activity"}, "updated": "2013-11-04T17:35:22.000Z", "actor": {"url": "https://plus.google.com/108406755709472416416", "image": {"url": "https://lh5.googleusercontent.com/-htd-H4jEyRE/AAAAAAAAAAI/AAAAAAAAMw4/yF0woOEJpZI/photo.jpg?sz=50"}, "displayName": "Margie Hearron", "id": "108406755709472416416"}, "annotation": "<b>How To Turn Off +1 Activity Sharing To Your G+ Followers</b><br>Go to Account Settings&gt;&gt;Google+&gt;&gt;Manage Apps and Activities&gt;&gt;Google&gt;&gt;Switch your +1 Activity to &quot;Only You&quot; <br><a href=\"https://plus.google.com/u/0/apps/google\" class=\"ot-anchor\" rel=\"nofollow\">https://plus.google.com/u/0/apps/google</a><br><br>Mobile Apps - Settings&gt;&gt;Your Name&gt;&gt;Sharing&gt;&gt;+1s from posts&gt;&gt; Switch to &quot;Only You&quot; privacy.<br><br>Mobile Web - Switch your browser to DESKTOP User Agent (Request Desktop Site or Website Preference to Desktop Mode) and then go to <br><a href=\"https://plus.google.com/u/0/apps/google\" class=\"ot-anchor\" rel=\"nofollow\">https://plus.google.com/u/0/apps/google</a> and switch the +1 activity sharing to &quot;Only You&quot; privacy.", "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/1zbe2tK5P13QYY3gFPFt9TGgkDc\"", "published": "2013-11-04T07:20:04.169Z", "id": "z12igt3q0tyysrjyg04cghgrhpmcchsorek"}, "NONE"]