[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "Who Did It First, Science or God, and A Biblical Lesson?\n\n\nWhy did Jeremiah 2000 years ago choose the...", "url": "https://plus.google.com/104699451308359350533/posts/NHmLpLWgtwa", "object": {"resharers": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ctbwxlua4hncvz23eydx4nlqghnmeq/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh4.googleusercontent.com/-0LpT9r9LDP0/Ukyrpf6lsnI/AAAAAAAAATE/aaxUzAtnVy0/y.png", "width": 479, "type": "image/jpeg", "height": 382}, "url": "https://plus.google.com/photos/104699451308359350533/albums/5930303530206425553/5930303538770326130?sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba&sqi=102098984492936602519&sqsi=c54cbebd-c21f-4fed-b8f5-ae115df70dba", "image": {"url": "https://lh4.googleusercontent.com/-0LpT9r9LDP0/Ukyrpf6lsnI/AAAAAAAAATE/aaxUzAtnVy0/w506-h750/y.png", "width": 506, "type": "image/jpeg", "height": 750}, "content": "y.png", "id": "104699451308359350533.5930303538770326130", "objectType": "photo"}], "url": "https://plus.google.com/104699451308359350533/posts/UrcihpGE7xr", "actor": {"url": "https://plus.google.com/104699451308359350533", "image": {"url": "https://lh6.googleusercontent.com/-Spq1H8bKOMI/AAAAAAAAAAI/AAAAAAAAAB4/P4etJCUzbq4/photo.jpg?sz=50"}, "displayName": "The Truth", "id": "104699451308359350533"}, "content": "Who Did It First, Science or God, and A Biblical Lesson?<br /><br /><br />Why did Jeremiah 2000 years ago choose the stork as an object lesson for the unfaithful Jews?<br /><br />“EVEN the stork in the heavens—it well knows its appointed times. But as for my people, they have not come to know the judgment of God Almighty.” (Jeremiah 8:7)<br />.<br />With those words, the prophet Jeremiah sounded God&#39;s judgment against the apostate people of Judah, who had left their God and turned to the worship of foreign deities. (Jeremiah 7:18,31)<br />.<br />When reprimanding the apostate people of Judah who failed to discern the time of God&#39;s judgment, the prophet Jeremiah called their attention to the stork and other birds that ‘well know their appointed times.’ evidently refers to the seasonal arrival of migratory birds in his censuring the Israelite for not discerning the time of God’s judgment on them.<br />.<br />To the Israelite, the stork, and especially the white stork, was a familiar sight as thousands of these birds pass through in the autumn and the spring following their migratory timetable and among those that “observe well the time of each one’s coming in”.<br />.<br />What we know about the stork?  <br />.<br />The Bible further pinpoint the storks activity. <br />.<br />Where the birds themselves make nests, As for the stork, the juniper trees are its house. Psalms 104:17<br />.<br />Contrasting the flightless ostrich with the high-flying stork, God Almighty asked Job: “Has the wing of the female ostrich flapped joyously, or has she the pinions of a stork and the plumage?”<br />(Job 39:13 )<br />.<br />The stork’s pinions are of great breadth and power, the secondary and tertiary feathers being almost as long as the primaries, giving an immense surface to the wing and enabling the stork to be a bird of lofty and long-continued flight. <br />.<br />A stork in flight soaring on its powerful wings, with its neck extended and its long legs stretched out straight behind it, makes an imposing sight. also with the rushing sound produced by the air passing through the stork’s pinions. The primary feathers are fingered out in flight so that slots are formed at the ends of the wings, thereby controlling the airflow over the top of the wings and improving their lifting power. <br />.<br />The stork is a large, long-legged wading bird similar to the ibis and heron. The white stork  (Ciconia ciconia) has white plumage except for the flight feathers of its wings, which are a glossy black. White storks breed in Northern Europe and winter in South Africa, making a round trip of 15,000 miles (24,000km). <br />.<br />The Hebrew name for this large, long-legged wading bird is the feminine form of a word that means “loyal one; one of loving-kindness.” This is fitting, for unlike most other birds, male and female white storks remain paired for life. After wintering in warmer regions, most storks return year after year, often to the same nest that they have used before.<br />.<br />The stork’s instinctive behavior illustrates the quality of loyalty in other remarkable ways. Both male and female birds share in incubating the eggs and feeding the chicks.<br />.<br /> The book Our Magnificent Wildlife explains: “As parents, storks are exceptionally faithful. A male stork in Germany flew into high-tension wires and was electrocuted. His mate continued to incubate the eggs alone for 3 days, during which she left the nest only once for a short time to look for food. In another case, when the female stork was shot, the father reared the young on it&#39;s own.<br />.<br /> What Can We Learn From The Stork Today?<br /><br />To many people today, loyalty and faithfulness are quaint ideas—admirable but not practical. <br />.<br />The proliferation of divorce, abandonment, embezzlement, and other forms of deceit demonstrates that loyalty is no longer valued.<br />.<br />In contrast, the Bible places a high value on loyalty that is motivated by love and kindness. It urges Christians to “put on the new personality which was created according to God’s will in true righteousness and loyalty.” (Ephesian 4:24) Yes, the new personality helps us to be loyal, but we can also learn a lesson about loyalty from the stork.<br />.<br />Indeed, by instinctively showing faithfulness to its lifelong mate and tender care for its young, the stork lives up to the meaning of its name—“loyal one.” Thus, storks served well as a powerful lesson to the unfaithful and wayward Israelite.<br />.<br />The Stork and Science, what has man studied?<br />.<br />Storks tend to use soaring, gliding flight, which conserves energy. Soaring requires thermal air currents. Ottomar Anschutz&#39;s famous 1884 album of photographs of storks inspired the design of Otto Lilienthal&#39;s experimental gliders of the late 19th century. Storks are heavy, with wide wingspans: the Marabou Stork, with a wingspan of 3.2m (10.5ft) and weight up to 8 kg (18 lbs), joins the Andean Condor in having the widest wingspan of all land birds. <br /><br />Thanks<br /><br />The Truth<br /><br />Please see video!<br /><a href=\"http://www.youtube.com/watch?v=DHuH7KaPbLc\" class=\"ot-anchor\" rel=\"nofollow\">BBC Earthflight (Winged Planet) - Common Cranes Fly Over Venice (Narrated by David Tennant)</a>", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ctbwxlua4hncvz23eydx4nlqghnmeq/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ctbwxlua4hncvz23eydx4nlqghnmeq/comments"}, "id": "z13fzpizsmuthrl5a04chftbomiatlqides", "objectType": "activity"}, "updated": "2013-11-01T08:34:06.729Z", "actor": {"url": "https://plus.google.com/104699451308359350533", "image": {"url": "https://lh6.googleusercontent.com/-Spq1H8bKOMI/AAAAAAAAAAI/AAAAAAAAAB4/P4etJCUzbq4/photo.jpg?sz=50"}, "displayName": "The Truth", "id": "104699451308359350533"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/jTYxu879456NpJHVsu5WlcB44n4\"", "published": "2013-11-01T08:34:06.729Z", "id": "z12ctbwxlua4hncvz23eydx4nlqghnmeq"}, "NONE"]