[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "About the Rosary...........\n\nThe Rosary of the Virgin Mary, which gradually took form in the second ...", "url": "https://plus.google.com/110382321791974146957/posts/YQCQi7XDqHj", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z135hnxxmxixdjrhv04cfdpxkmnmilyphrs0k/people/resharers"}, "attachments": [{"displayName": "About the Rosary...........\n\nThe Rosary of the Virgin Mary, which gradually took form in the second millennium under the guidance of the Spirit of God, is a prayer loved by countless Saints and encouraged by the Magisterium. Simple yet profound, it still remains, at the dawn of this third millennium, a prayer of great significance, destined to bring forth a harvest of holiness….\"\nThere are two major theories on the origin of the Rosary. The traditional theory attributes the origin to St. Dominic in the 13th century. The Catholic Encyclopedia says that \"the Feast of the Holy Rosary informs us that, when the Albigensian heresy was devastating the country of Toulouse, St. Dominic earnestly be sought the help of Our Lady and was instructed by her…to preach the Rosary among the people as an antidote to heresy and sin.\" (The following is taken mostly from the Catholic Encyclopedia. An online edition is available at www.newadvent.org).\nThe use of beads has a practical significance. When we are praying certain prayers or Psalms, etc., to focus our attention on the Lord, the use of beads helps us to stay on track so as to not be distracted by counting. When monks or peasantry would work in the fields they would use pebbles, berries or cords with knots tied into them. For the monk, this also was a tool to use in following Paul's injunction to \"pray without ceasing\" (1 Thess. 5:17).\nThis eventually developed into putting beads on a string to aid in prayer. In fact, the word bead itself comes from the Old Saxon word bede, which simply means \"a prayer.\" The term \"Rosary\" comes from the word rosarius and means \"a garland or bouquet of roses.\" Thus, the prayer itself is the Rosary and the collection or \"garland\" of beads we use to pray it is likewise called Rosary.\nThe second theory is that, beginning in the 12 century, the Rosary developed in imitation of the 150 biblical Psalms that priests and religious were required to pray over a certain period of time. Some monks even prayed all 150 Psalms every day. The 150 Psalms made up the \"Psalter,\" part of the Breviary, the Church's official daily prayers. According to this theory, the Rosary developed as a substitute for the Breviary for those faithful who didn't have the money to learn to read, but nevertheless desired a regular means by which they could express their devotion to Jesus and Mary through memorized prayers. Originally, the faithful would pray a psalter of the Lord's Prayer (i.e., 150 \"Our Fathers\" or \"Paters\"). The Paters were eventually divided into three sets of 50, with strings of beads, called \"paternosters\" (i.e., \"Our Fathers\") used to keep count. Marian devotion followed a similar trend, with a psalter of \"Aves\" or \"Hail Marys\" developing. The Rosary mysteries developed on a parallel course, beginning with the Joyful and progressing to the Sorrowful and Glorious.\nEventually, the two psalters were united, a Hail Mary following each Our Father. Then, in the early 15th century, a Carthusian named Henry Kalkar is credited with bracketing the 150 Hail Marys into decades (sets of ten), separated by Our Fathers. Shortly thereafter, the Hail Mary's were separated into five decades. The Rosary at that time resembled its current form, although there has since been further development. The latest is the addition of the five Luminous mysteries.\nThe authentic Rosary is a happy combination of vocal and mental prayer, each of which is essential to the devotion. It is incorrect to say that meditation is \"the very essence of the Rosary devotion,\" for vocal recitation of the prayers is also of the essence. Meditation is, of course, the nobler element, the \"soul,\" while vocal prayer is the \"body\" of the devotion. The Rosary, Pope Leo XIII declared, \"is composed of two parts, distinct but inseparable — the meditation on the mysteries and the recitation of the prayers. It is thus a kind of prayer that requires not only some raising of the soul to God, but also a particular and explicit attention\" (Incunda semper). Hence, as Pope Pius XI stated, they err \"who consider this devotion merely a bore some formula repeated with monotonous and singsong intonation\" (Ingravescentibus malis). Moreover, as Pius XI put it, \"both piety and love, although always breathing forth the same words, do not, however, repeat the same thing, but they fervently express something ever new which the loving heart always sends forth.\" And finally, in the words of Pius XII, \"the recitation of identical formulas, repeated so many times, rather than rendering the prayer sterile and boring, has on the contrary the admirable quality of infusing confidence in him who prays, and brings to bear a gentle compulsion on the motherly heart of Mary (Ingravescentibus malis). — Mariology, Juniper B. Carol, O.F.M.", "fullImage": {"url": "https://lh6.googleusercontent.com/-H4WLHm7btXA/Ukpp01fs4EI/AAAAAAAAABY/ltkHXIcE68M/w268-h242/1011052_380421482063859_111767776_n.jpg", "width": 268, "type": "image/jpeg", "height": 242}, "url": "https://plus.google.com/photos/110382321791974146957/albums/5929668211021425313/5929668215820836930?sqi=111338503006922439435&sqsi=e3fca9f6-f6c7-49cf-b1ee-9302d76002ca", "image": {"url": "https://lh6.googleusercontent.com/-H4WLHm7btXA/Ukpp01fs4EI/AAAAAAAAABY/ltkHXIcE68M/w506-h750/1011052_380421482063859_111767776_n.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "1011052_380421482063859_111767776_n.jpg", "id": "110382321791974146957.5929668215820836930", "objectType": "photo"}], "url": "https://plus.google.com/110382321791974146957/posts/cwxJcLi5tip", "actor": {"url": "https://plus.google.com/110382321791974146957", "image": {"url": "https://lh6.googleusercontent.com/-tVEfKBG4Rkc/AAAAAAAAAAI/AAAAAAAAASU/Toz_u712Ot0/photo.jpg?sz=50"}, "displayName": "God Loves You", "id": "110382321791974146957"}, "content": "<b>About the Rosary...........</b><br /><br />The Rosary of the Virgin Mary, which gradually took form in the second millennium under the guidance of the Spirit of God, is a prayer loved by countless Saints and encouraged by the Magisterium. Simple yet profound, it still remains, at the dawn of this third millennium, a prayer of great significance, destined to bring forth a harvest of holiness….&quot;<br />There are two major theories on the origin of the Rosary. The traditional theory attributes the origin to St. Dominic in the 13th century. The Catholic Encyclopedia says that &quot;the Feast of the Holy Rosary informs us that, when the Albigensian heresy was devastating the country of Toulouse, St. Dominic earnestly be sought the help of Our Lady and was instructed by her…to preach the Rosary among the people as an antidote to heresy and sin.&quot; (The following is taken mostly from the Catholic Encyclopedia. An online edition is available at <a href=\"http://www.newadvent.org\" class=\"ot-anchor\" rel=\"nofollow\">www.newadvent.org</a>).<br />The use of beads has a practical significance. When we are praying certain prayers or Psalms, etc., to focus our attention on the Lord, the use of beads helps us to stay on track so as to not be distracted by counting. When monks or peasantry would work in the fields they would use pebbles, berries or cords with knots tied into them. For the monk, this also was a tool to use in following Paul&#39;s injunction to &quot;pray without ceasing&quot; (1 Thess. 5:17).<br />This eventually developed into putting beads on a string to aid in prayer. In fact, the word bead itself comes from the Old Saxon word bede, which simply means &quot;a prayer.&quot; The term &quot;Rosary&quot; comes from the word rosarius and means &quot;a garland or bouquet of roses.&quot; Thus, the prayer itself is the Rosary and the collection or &quot;garland&quot; of beads we use to pray it is likewise called Rosary.<br />The second theory is that, beginning in the 12 century, the Rosary developed in imitation of the 150 biblical Psalms that priests and religious were required to pray over a certain period of time. Some monks even prayed all 150 Psalms every day. The 150 Psalms made up the &quot;Psalter,&quot; part of the Breviary, the Church&#39;s official daily prayers. According to this theory, the Rosary developed as a substitute for the Breviary for those faithful who didn&#39;t have the money to learn to read, but nevertheless desired a regular means by which they could express their devotion to Jesus and Mary through memorized prayers. Originally, the faithful would pray a psalter of the Lord&#39;s Prayer (i.e., 150 &quot;Our Fathers&quot; or &quot;Paters&quot;). The Paters were eventually divided into three sets of 50, with strings of beads, called &quot;paternosters&quot; (i.e., &quot;Our Fathers&quot;) used to keep count. Marian devotion followed a similar trend, with a psalter of &quot;Aves&quot; or &quot;Hail Marys&quot; developing. The Rosary mysteries developed on a parallel course, beginning with the Joyful and progressing to the Sorrowful and Glorious.<br />Eventually, the two psalters were united, a Hail Mary following each Our Father. Then, in the early 15th century, a Carthusian named Henry Kalkar is credited with bracketing the 150 Hail Marys into decades (sets of ten), separated by Our Fathers. Shortly thereafter, the Hail Mary&#39;s were separated into five decades. The Rosary at that time resembled its current form, although there has since been further development. The latest is the addition of the five Luminous mysteries.<br />\tThe authentic Rosary is a happy combination of vocal and mental prayer, each of which is essential to the devotion. It is incorrect to say that meditation is &quot;the very essence of the Rosary devotion,&quot; for vocal recitation of the prayers is also of the essence. Meditation is, of course, the nobler element, the &quot;soul,&quot; while vocal prayer is the &quot;body&quot; of the devotion. The Rosary, Pope Leo XIII declared, &quot;is composed of two parts, distinct but inseparable — the meditation on the mysteries and the recitation of the prayers. It is thus a kind of prayer that requires not only some raising of the soul to God, but also a particular and explicit attention&quot; (Incunda semper). Hence, as Pope Pius XI stated, they err &quot;who consider this devotion merely a bore some formula repeated with monotonous and singsong intonation&quot; (Ingravescentibus malis). Moreover, as Pius XI put it, &quot;both piety and love, although always breathing forth the same words, do not, however, repeat the same thing, but they fervently express something ever new which the loving heart always sends forth.&quot; And finally, in the words of Pius XII, &quot;the recitation of identical formulas, repeated so many times, rather than rendering the prayer sterile and boring, has on the contrary the admirable quality of infusing confidence in him who prays, and brings to bear a gentle compulsion on the motherly heart of Mary (Ingravescentibus malis). — Mariology, Juniper B. Carol, O.F.M.<br /><a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23Rosary\">#Rosary</a>", "plusoners": {"totalItems": 5, "selfLink": "https://www.googleapis.com/plus/v1/activities/z135hnxxmxixdjrhv04cfdpxkmnmilyphrs0k/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z135hnxxmxixdjrhv04cfdpxkmnmilyphrs0k/comments"}, "id": "z13utvzqlwahtxxiq04cfdpxkmnmilyphrs0k", "objectType": "activity"}, "updated": "2013-10-29T07:19:33.997Z", "actor": {"url": "https://plus.google.com/110382321791974146957", "image": {"url": "https://lh6.googleusercontent.com/-tVEfKBG4Rkc/AAAAAAAAAAI/AAAAAAAAASU/Toz_u712Ot0/photo.jpg?sz=50"}, "displayName": "God Loves You", "id": "110382321791974146957"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "God Loves You (Discussion)"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/-pSjPeDcOuhe7C89Y94wHP0B6jw\"", "published": "2013-10-29T07:19:33.997Z", "id": "z135hnxxmxixdjrhv04cfdpxkmnmilyphrs0k"}, "NONE"]