[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "132. What is the aim of the incarnation of spirits.?\n\"It is a necessity imposed on them by God, as the...", "url": "https://plus.google.com/117808452898479187307/posts/3D81TWPUG9P", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12xgpwitoqsfnakh22vgjn5wzrvurx0k/people/resharers"}, "attachments": [{"displayName": "132. What is the aim of the incarnation of spirits.?\n\"It is a necessity imposed on them by God, as the means of attaining perfection. For some of them it is an expiation; for others, a mission. In order to attain perfection, it is necessary for them to undergo all the vicissitudes of corporeal existence. It is the experience acquired by\nexpiation that constitutes its usefulness. Incarnation has also another aim-viz., that of fitting the spirit to perform his share in the work of creation; for which purpose he is made to assume a corporeal apparatus in harmony with the material state of each world into which he is sent, and by means of which he is enabled to accomplish the special work, in connection with that world which has been appointed to him by the divine ordering. He is thus made to contribute his quota towards the general weal, while achieving his own advancement.\"\nThe action of corporeal beings is necessary to the carrying on of the work of the universe ; but God in His wisdom has willed that this action should furnish them with the means of progress and of advancement\ntowards Himself. And thus, through an admirable law of His providence, all things are linked together, and solidarity is established between all the realms of nature.\nTHE SPIRITS’ BOOK ALLAN KARDEC", "fullImage": {"url": "https://lh3.googleusercontent.com/-qaz0IAvjtsU/Unvc1vG1jXI/AAAAAAAAQy0/0PjCe43QfSQ/w400-h321/poi.jpg", "width": 400, "type": "image/jpeg", "height": 321}, "url": "https://plus.google.com/photos/112813944870954627522/albums/5943586945031764289/5943586948981820786?sqi=114219705069151396377&sqsi=fb7e58b0-9c51-4c4f-82cf-a8729067f910", "image": {"url": "https://lh3.googleusercontent.com/-qaz0IAvjtsU/Unvc1vG1jXI/AAAAAAAAQy0/0PjCe43QfSQ/w506-h750/poi.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "poi.jpg", "id": "112813944870954627522.5943586948981820786", "objectType": "photo"}], "url": "https://plus.google.com/112813944870954627522/posts/DJpNQv3eJdf", "actor": {"url": "https://plus.google.com/112813944870954627522", "image": {"url": "https://lh3.googleusercontent.com/-epN0qNYd1RE/AAAAAAAAAAI/AAAAAAAAAEI/fKSSuZonVGk/photo.jpg?sz=50"}, "displayName": "divine morales", "id": "112813944870954627522"}, "content": "132. What is the aim of the incarnation of spirits.?<br />&quot;It is a necessity imposed on them by God, as the means of attaining perfection. For some of them it is an expiation; for others, a mission. In order to attain perfection, it is necessary for them to undergo all the vicissitudes of corporeal existence. It is the experience acquired by<br />expiation that constitutes its usefulness. Incarnation has also another aim-viz., that of fitting the spirit to perform his share in the work of creation; for which purpose he is made to assume a corporeal apparatus in harmony with the material state of each world into which he is sent, and by means of which he is enabled to accomplish the special work, in connection with that world which has been appointed to him by the divine ordering. He is thus made to contribute his quota towards the general weal, while achieving his own advancement.&quot;<br />The action of corporeal beings is necessary to the carrying on of the work of the universe ; but God in His wisdom has willed that this action should furnish them with the means of progress and of advancement<br />towards Himself. And thus, through an admirable law of His providence, all things are linked together, and solidarity is established between all the realms of nature.<br />THE SPIRITS’ BOOK ALLAN KARDEC", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12xgpwitoqsfnakh22vgjn5wzrvurx0k/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12xgpwitoqsfnakh22vgjn5wzrvurx0k/comments"}, "id": "z13xd3xibsikdtmmd23oxbejjze5cbalt", "objectType": "activity"}, "updated": "2013-11-08T12:47:08.327Z", "actor": {"url": "https://plus.google.com/117808452898479187307", "image": {"url": "https://lh4.googleusercontent.com/-2ss0LHSgpNY/AAAAAAAAAAI/AAAAAAAAACY/hmp9Ty0arUQ/photo.jpg?sz=50"}, "displayName": "alberto morais", "id": "117808452898479187307"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Beautiful planet Earth (Discussion)"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/rnWLbCmAhoGLHHudQgwuVl8LodI\"", "published": "2013-11-08T12:47:08.327Z", "id": "z12xgpwitoqsfnakh22vgjn5wzrvurx0k"}, "NONE"]