[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "Many people are discussing about Berlin these days, on traditional media, social media and blogs. It...", "url": "https://plus.google.com/114503312122661381040/posts/Kq7K7Pryova", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12pxrpyouywftmfk22mzby4fqrtthrf5/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-zwHum0ECzcM/UQcLH69YsyI/AAAAAAAAAE0/7ahb1aSXePk/w288-h288/IMG_3947.JPG", "width": 2048, "type": "image/jpeg", "height": 1365}, "url": "https://plus.google.com/photos/114503312122661381040/albums/5838647673964083505/5838647672622854946?authkey=CIK4x5Hro7OBbw", "image": {"url": "https://lh3.googleusercontent.com/-zwHum0ECzcM/UQcLH69YsyI/AAAAAAAAAE0/7ahb1aSXePk/w506-h750/IMG_3947.JPG", "width": 506, "type": "image/jpeg", "height": 750}, "content": "IMG_3947.JPG", "id": "114503312122661381040.5838647672622854946", "objectType": "photo"}], "url": "https://plus.google.com/114503312122661381040/posts/Kq7K7Pryova", "content": "Many people are discussing about Berlin these days, on traditional media, social media and blogs. It is out of discussion that the city is become a brand because of many startups that are born here every week. The key question is: is this a media driven hype without fundamentals, or is the city experiencing something that will change its DNA in the long term?<br /> <br />Personally I would with no doubt say that the latter is true due to a unique fusion of circumstances that are only to be found in Berlin.<br /> <br />There is a strong talent drain in south european nations (Italy and Spain in particular) and Berlin is truly benefitting from this as many young talented individuals are settling in. With austerity hitting hard, and youth unemployment rates of 37% in Italy and 50% in Spain, younger generations prefer to start something new in Berlin. Interestingly you will find both Italians and Spaniards with brilliant skills, sign that the most talented are those that are leaving their home country.<br /><br />There are dozens of places where those that are arrive con start working in, at no cost and with high speed wi-fi. Plenty of cafès and co-working spaces are all over the city. You see people drawing sketches, writing passionately for hours or simply working in front of their notebooks, all with the same goal: get inspired from the environment in the cafè and out in the streets. Some say that Steve Jobs used to change his office once a year to change the environment around him to increase inspiration and creativeness. The melting pot in Berlin works like magic for many, and you can change culture all over the place.<br /><br />Networking is crucial when it goes to transform an idea into a real early stage venture, you need contacts and trustful people that will help you in the journey. In Berlin dozens of events are organized every week, usually there is an extremely open and informal atmosphere. Finding a co-founder, talking to a Venture Capitalist or to a lawyer is that easy that many get astonished after getting out of the first event here. The real difference between other ecosystems in Europe is that there is a high concentration of like minded people with different skills and backgrounds and all are working in a very relaxed athmosphere<br /><br />Finally capital is key, without that your startup stays in the garage. These days its all about execution and without a big cash check you will hardly get known outside your friends and friends of friends. Well the good news is that according to DowJones Venture source the total value of fundings has increased by +48% from 2011. In the same time London had a decrease of 5%. So be confident and search for the cash.", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12pxrpyouywftmfk22mzby4fqrtthrf5/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12pxrpyouywftmfk22mzby4fqrtthrf5/comments"}, "objectType": "note"}, "updated": "2013-01-28T23:35:09.574Z", "actor": {"url": "https://plus.google.com/114503312122661381040", "image": {"url": "https://lh5.googleusercontent.com/-181jRYO4sps/AAAAAAAAAAI/AAAAAAAAAL8/Yr5u0NUTkvk/photo.jpg?sz=50"}, "displayName": "digital allee", "id": "114503312122661381040"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/YNmlhrr_gain2PSCe774PIN5k0Y\"", "published": "2013-01-28T23:35:09.574Z", "id": "z12pxrpyouywftmfk22mzby4fqrtthrf5"}, "NONE"]