[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "Rupert Murdoch wanted to quit News Corp before the scandal\n\nMogul Rupert Murdoch wanted to quit News...", "url": "https://plus.google.com/104632572959017350000/posts/Xij2vzGSid5", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ogx3jyra1v3p5r04chxwomyeysbibung0k/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-cfB93EtQBeM/Tia_A3rbowI/AAAAAAAAAY0/YtU4YfgJzwg/w288-h288/rupert.jpg", "width": 448, "type": "image/jpeg", "height": 284}, "url": "https://plus.google.com/photos/104632572959017350000/albums/5631398405723268113/5631398405740405506", "image": {"url": "https://lh5.googleusercontent.com/-cfB93EtQBeM/Tia_A3rbowI/AAAAAAAAAY0/YtU4YfgJzwg/w506-h750/rupert.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "rupert.jpg", "id": "104632572959017350000.5631398405740405506", "objectType": "photo"}], "url": "https://plus.google.com/104632572959017350000/posts/Xij2vzGSid5", "content": "Rupert Murdoch wanted to quit News Corp before the scandal<br /><br />Mogul Rupert Murdoch wanted to quit News Corp long before the scandal of the illegal interceptions appeared.<br />According to Wall Street Journal, Murdoch, 80 years old, wanted to hand over the leading of the media empire to Chase Carey, the Chief Executive of the company and according to his plans, this transition should had been made next year.<br />Wall Street Journal gave the news citing sources close to old Murdoch and according to their sources that was a decision that was made before the huge scandal of the illegal interceptions from the journalists from News of the World. <br />The Wall Street Journal adds though that even that Murdoch had quitted the leading of his empire, he remained anyway the President.<br />The author of the article says that the decision didn’t affect in any way the News of the World’s progress, but as a symbolic gesture, it had been very important. Rupert Murdoch has two nationalities.<br /><br />He is an Australian and American citizen and is one of the most important media magnates in the entire world.<br />He will appear in front of the British Parliament on Tuesday in order to explain the economical and political implications of the illegal interceptions scandal. He will appear in front of ten representatives from the Media Committee of the Common Chamber along with his son James, 38 years old, and his trustful person, Rebekah Brooks, the 43 years old “tabloid queen” that was already deposed.<br />They will have to answer in detail about everything that concerns the illegal interpretations that News of the World made all this years.<br />The tabloid, one of the oldest from Great Britain, than News Corp closed a few days ago, is accused of listening from more than ten years the messages and the personal phone conversations of more than 4000 people.<br />Among the people that were supervised there are political figures, celebrities and even an assassinated young girl. The scandal is not only at the media level, but it includes also the business environment and the political one.<br />The public figures from Great Britain are indignant, including the Scotland Yard officials or the politicians from David Cameron’s Government.<br />Wall Street Journal thinks that even though Rupert Murdoch decides to leave the media empire for someone else, he will have to take this decision after a while so that the scandal that is above News Corp in this moment to disappear and this will probably happens after some months, the article’s author thinks.", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ogx3jyra1v3p5r04chxwomyeysbibung0k/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ogx3jyra1v3p5r04chxwomyeysbibung0k/comments"}, "objectType": "note"}, "updated": "2011-07-20T11:41:59.286Z", "actor": {"url": "https://plus.google.com/104632572959017350000", "image": {"url": "https://lh6.googleusercontent.com/-4cWwSFcArZI/AAAAAAAAAAI/AAAAAAAAAvY/oEyNB4mYUqQ/photo.jpg?sz=50"}, "displayName": "Ramesh Reddy", "id": "104632572959017350000"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/qk8fazai8lM0iGKsxgn7DP5yE4s\"", "published": "2011-07-20T11:41:59.286Z", "id": "z12ogx3jyra1v3p5r04chxwomyeysbibung0k"}, "NONE"]