[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "House sales were 12% higher in first four months of 2012 compared to 2011 according to the latest LSL...", "url": "https://plus.google.com/112861913881190681835/posts/FaxqEe3qi6z", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ju1ki3setybaer23cgdbh3xioh3jp404/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-_1f42ZCjXKk/T-NqWti7nUI/AAAAAAAAAL8/qwlsROzT46M/w288-h288/FDP%2B163%2B007s25.jpg", "width": 2048, "type": "image/jpeg", "height": 1362}, "url": "https://plus.google.com/photos/112861913881190681835/albums/5756561684481413889/5756561687125400898", "image": {"url": "https://lh5.googleusercontent.com/-_1f42ZCjXKk/T-NqWti7nUI/AAAAAAAAAL8/qwlsROzT46M/w506-h750/FDP%2B163%2B007s25.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "FDP 163 007s25.jpg", "id": "112861913881190681835.5756561687125400898", "objectType": "photo"}], "url": "https://plus.google.com/112861913881190681835/posts/FaxqEe3qi6z", "content": "House sales were 12% higher in first four months of 2012 compared to 2011 according to the latest LSL/Acadametrics Scotland House Price Index.<br />Prices have recovered to the same level as 5 years ago with Edinburgh in particular showing strong annual prices rises.<br /><br />Richard Sexton, director of e.surv chartered surveyors, part of LSL, comments: “The housing market is coping admirably with the treacherous economic conditions swirling around it. Prices have risen for the second month in a row, suggesting the market may have turned a corner following a difficult winter period where prices fell for four consecutive months.<br /><br />‘Cautious optimism’ describes the prospects for the market over the coming months. Demand for moving home is still strong, despite buyers having to piece together big deposits to access affordable mortgages. Plenty of buyers are sick of being stuck in expensive rental accommodation. Rather than line the pockets of landlords, many of them have decided to roll up their sleeves and piece together a deposit.<br /><br />But it was a lack of mortgages, rather than weak demand, which has paralyzed the market in the past and dragged down prices. That’s why all eyes will be on the economy and the Eurozone. Borrowers will be hoping banks show enough resilience to resist the effects of a gridlocked economy and the deteriorating situation in the Eurozone. The prospects for the housing market will be inextricably linked to decisions made in Berlin, Madrid and Athens. If investor confidence in the euro disintegrates completely, and Greece makes a messy exit from the single currency, it could restrict banks’ ability to grant mortgages, particularly to first time buyers.<br /><br />On a regional basis, prices are much more varied. Edinburgh and Aberdeen have seen hefty price increases compared to April last year, while on the flip side homeowners in Glasgow and Ayrshire have seen great chunks chiselled off the value of their home during the same period. A word of warning: despite prices increasing nationally, 18 of the 32 local authorities in Scotland have seen house values fall over the last year. Some areas have struggled more than others with the effects of the downturn and public sector austerity, with local economies still reeling from the effects of high unemployment and weak private sector investment. This has pushed down house prices well below the national average in some localities.”", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ju1ki3setybaer23cgdbh3xioh3jp404/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ju1ki3setybaer23cgdbh3xioh3jp404/comments"}, "objectType": "note"}, "updated": "2012-06-21T18:39:45.921Z", "actor": {"url": "https://plus.google.com/112861913881190681835", "image": {"url": "https://lh4.googleusercontent.com/-JlCkOfY_QX4/AAAAAAAAAAI/AAAAAAAAAQs/3wJud0BCVwQ/photo.jpg?sz=50"}, "displayName": "Clear Property Advice", "id": "112861913881190681835"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/o4tHwjxcN7dUJ_OmfZnrpWLY04Q\"", "published": "2012-06-21T18:39:45.921Z", "id": "z12ju1ki3setybaer23cgdbh3xioh3jp404"}, "NONE"]