[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "Linde launches ground breaking cryogenic transportation system\n\nLinde Gases, a division of The Linde...", "url": "https://plus.google.com/118043132907719664235/posts/Z1gLB9vKyFR", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132h1b54o2supghz04cglvazymrexfxsfs/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh6.googleusercontent.com/-QNY8_M1W6c0/T7DPXj1X-OI/AAAAAAAAAQY/wIBUjy0J_Co/w288-h288/FROSTCRUISE_truck_60014.jpg", "width": 1006, "type": "image/jpeg", "height": 768}, "url": "https://plus.google.com/photos/118043132907719664235/albums/5742317527304564849/5742317528560433378", "image": {"url": "https://lh6.googleusercontent.com/-QNY8_M1W6c0/T7DPXj1X-OI/AAAAAAAAAQY/wIBUjy0J_Co/w506-h750/FROSTCRUISE_truck_60014.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "FROSTCRUISE_truck_60014.jpg", "id": "118043132907719664235.5742317528560433378", "objectType": "photo"}], "url": "https://plus.google.com/118043132907719664235/posts/Z1gLB9vKyFR", "content": "Linde launches ground breaking cryogenic transportation system<br /><br />Linde Gases, a division of The Linde Group, today announced the launch of FROSTCRUISE®, a highly innovative in-transit refrigeration system which will provide a more environmentally friendly, efficient and reliable cryogenic alternative to diesel-powered mechanical refrigeration. <br /><br />FROSTCRUISE® is a powerful cooling technology that indirectly uses the cryogenic effect of liquid nitrogen (LIN) at a temperature of -196°C to provide rapid and evenly distributed temperature pull-down. It also has the ability to maintain accurate product temperature throughout the truck compartment despite multiple delivery stops, reducing the risk of food spoilage and improving food safety. <br /><br />Importantly, FROSTCRUISE® also provides significant environmental benefits including substantial noise reduction during deliveries and a much lower carbon footprint than traditional mechanical transportation systems.  <br /><br />“FROSTCRUISE® represents a major development for the food distribution industry,” said Mark Ewig, Global Strategic Marketing and Development Manager, Food and Beverage, Linde Gases Division. “Its ability to cope with the rigorous demands of maintaining consistently very cold temperatures, added to the significant environmental benefits, for what will be comparable costs of a standard mechanical refrigeration system, means FROSTCRUISE® is set to transform road transportation of chilled and frozen perishable items.” <br /><br />Existing diesel operated refrigeration systems often require drivers to either leave their vehicles running or mechanical refrigeration units in operation while dropping off goods, resulting in greater fuel consumption, noise and emissions in urban environments. In an attempt to improve air quality, cities are increasingly introducing low emission zones, with legislation restricting deliveries. Additionally, laws also limit noise pollution in urban areas to 60-65 decibels (dB) between the hours of 22.00 and 06.00, a level which most diesel-operated refrigeration systems struggle to achieve. <br /><br />FROSTCRUISE® refrigeration technology mitigates the need for vehicle engines in order to perform the cooling process and so is substantially quieter than diesel systems which need to remain running in order to maintain a low compartment temperature. The lack of reliance on a vehicle engine also means that the refrigeration system can run independently in the event of a mechanical breakdown, protecting the compartment contents. <br /><br />FROSTCRUISE® has already seen early success in the market. MacFood Services, a leading food processor and distributor to the quick service restaurant industry in Malaysia, has recently taken on a fleet of 14 FROSTCRUISE® enabled trucks to deliver their frozen products including burger patties, nuggets and French fries. <br /><br />“MacFood has rigorous safety standards and FROSTCRUISE® has proven to meet our very demanding specifications on temperature,” said Viktor Sim, Deputy Managing Director, MacFood. “It has also coped admirably with the demands of maintaining those very cold temperatures despite multiple delivery stops required on an average day in extremely hot and humid climate conditions.”<br /><br /><br />Contact<br />Susan Brownlow<br />Public Relations Manager, Linde Gases Division<br />Telephone: +44 (0)7825 853814<br />Email: <a href=\"mailto:susan.brownlow@linde.com\" class=\"ot-anchor\">susan.brownlow@linde.com</a><br /><br />Clare Daly or Suzannah Greenwood<br />Hill + Knowlton Strategies<br />Telephone: +44 207 973 5912 or +44 207 413 3348 <br />Email: <a href=\"mailto:clare.daly@hkstrategies.com\" class=\"ot-anchor\">clare.daly@hkstrategies.com</a> or <a href=\"mailto:suzannah.greenwood@hkstrategies.com\" class=\"ot-anchor\">suzannah.greenwood@hkstrategies.com</a>", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132h1b54o2supghz04cglvazymrexfxsfs/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z132h1b54o2supghz04cglvazymrexfxsfs/comments"}, "objectType": "note"}, "updated": "2012-05-14T09:24:57.336Z", "actor": {"url": "https://plus.google.com/118043132907719664235", "image": {"url": "https://lh4.googleusercontent.com/-qLoqwxHyHPc/AAAAAAAAAAI/AAAAAAAAAQI/R9bxKZJuw0I/photo.jpg?sz=50"}, "displayName": "The Linde Group", "id": "118043132907719664235"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/Ynh84pUlddAIVOyGbfoRi6hV3Ms\"", "published": "2012-05-14T09:24:57.336Z", "id": "z132h1b54o2supghz04cglvazymrexfxsfs"}, "NONE"]