[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "I'm wondering if this campaign (Action to end #hatespeech  on FB) would work with Google as well. \nGoogle...", "url": "https://plus.google.com/108482539820581852184/posts/2MzDZ3Xc4jf", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12rgfqwnxjdtd4kc22wzf3adlyti1hut/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh6.googleusercontent.com/-rOrkNiLRjak/UnlrsOHSE2I/AAAAAAAAY7g/PAagxR3lIkQ/Screen-Shot-2013-10-18-at-10.59.04-AM.jpg", "width": 950, "type": "image/jpeg", "height": 534}, "url": "https://plus.google.com/photos/115755681170066793486/albums/5942899583479422801/5942899590739137378", "image": {"url": "https://lh6.googleusercontent.com/-rOrkNiLRjak/UnlrsOHSE2I/AAAAAAAAY7g/PAagxR3lIkQ/w506-h750/Screen-Shot-2013-10-18-at-10.59.04-AM.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "Screen-Shot-2013-10-18-at-10.59.04-AM.jpg", "id": "115755681170066793486.5942899590739137378", "objectType": "photo"}], "url": "https://plus.google.com/115755681170066793486/posts/Ah67hESVS4P", "actor": {"url": "https://plus.google.com/115755681170066793486", "image": {"url": "https://lh5.googleusercontent.com/-wZQGj1oIQUI/AAAAAAAAAAI/AAAAAAAAUKY/Ecb1DdOav-0/photo.jpg?sz=50"}, "displayName": "Bettina Ascaino", "id": "115755681170066793486"}, "content": "<b>I&#39;m wondering if this campaign (Action to end  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23hatespeech\">#hatespeech</a>   on FB) would work with Google as well.</b> <br />Google does censor some stuff like Facebook. [Have a look on this article:  <a href=\"http://mashable.com/2013/10/18/google-autocomplete-sexism/\" class=\"ot-anchor\" rel=\"nofollow\">http://mashable.com/2013/10/18/google-autocomplete-sexism/</a> ] I had a conversation with a journalist on Twitter, Lisa Wirthman, and we agreed that more women in Tech would influence attitudes, and also Marketers spreading more quality and thought provoking content. <b>What do you think?</b><br /><br />                                    ▋▄▅██▃ ▅     <br /><br /><b>Take Action To End Gender-Based Hate Speech on Facebook</b><br />Breaking:<br /><br />IT WORKED! Read our statement here* (bottom of page) <br />Facebook has long allowed content endorsing violence against women. They claim that these pages fall under the “humor” part of their guidelines, or are expressions of “free speech.” But Facebook has proven willing to crack down on other forms of hate speech, including anti-Semitic, Islamophobic and homophobic speech, without claiming such exemptions.<br /><br />That’s why we’re calling on Facebook to make the only responsible decision and ban gender-based hate speech. Can you help?<br /><br />Below are prominent companies whose Facebook ads have appeared alongside violent, hateful content. Will you join us in asking them to stop advertising on Facebook until Facebook takes real action to end gender-based hate speech on its site?<br /><br />CAMPAIGN UPDATE: Over 60,000 tweets and over 5000 emails later, it worked! Read our statement here<br /><br /><a href=\"http://www.womenactionmedia.org/facebookaction/\" class=\"ot-anchor\" rel=\"nofollow\">http://www.womenactionmedia.org/facebookaction/</a><br /><br /><br /><br /><b>STATEMENT</b> May 28, 2013 <br /><br />Last Tuesday, Women, Action &amp; the Media, the Everyday Sexism Project and author/activist Soraya Chemaly launched a campaign to call on Facebook to take concrete, effective action to end gender-based hate speech on its site. Since then, participants sent over 60,000 tweets and 5000 emails, and our coalition has grown to over 100 women’s movement and social justice organizations.<br /><br />Today, we are pleased to announce that Facebook has responded with a important commitment to refine its approach to hate speech. Facebook has admirably done more than most other companies to address this topic in regards to content policy. In a statement released today, Facebook addressed our concerns and committed to evaluating and updating its policies, guidelines and practices relating to hate speech, improving training for its content moderators and increasing accountability for creators of misogynist content.<br /><br />Facebook has also invited Women, Action &amp; the Media, The Everyday Sexism Project and members of our coalition to contribute to these efforts and be part of an ongoing conversation. As part of these efforts, we will work closely with Facebook on the issue of how Community Standards around hate speech are evaluated and to ensure best practices represent the interests of our coalition.<br /><br />For details regarding Facebook’s response, please visit here.<br /><br />Facebook has already been a leader on the internet in addressing hate speech on its service. We believe that this is the foundation for an effective working collaboration designed to confront gender-based hate speech effectively. Our mutual intent is to create safe spaces, both on and off-line. We see this as a vital and essential component to the valuable work that Facebook is doing to address cyber-bulling, harassment and real harm.<br /><br />“It is because Facebook has committed to having policies to address these issues that we felt it was necessary to take these actions and press for that commitment to fully recognize how the real world safety gap experienced by women globally is dynamically related to our online lives,” explains Soraya Chemaly.<br /><br />“We have been inspired and moved beyond expression by the outpouring of energy, creativity and support for this campaign from communities, companies and individuals around the world. It is a testament to the strength of public feeling behind these issues.” says Laura Bates, founder of the Everyday Sexism Project.<br /><br />Jaclyn Friedman, executive director of Women Action and the Media (WAM!), said: “We are reaching an international tipping point in attitudes towards rape and violence against women. We hope that this effort stands as a testament to the power of collaborative action.”<br /><br />We are hopeful that this moment will mark an historic transition in relation to media and women’s rights in which Facebook is acknowledged as a leader in fostering safer, genuinely inclusive online communities, setting industry precedents for others to follow.We look forward to collaborating with these communities on actions both big and small until we live in a world that’s safe and just for women and girls, and for everyone.<br /><br /><br /><br />FacebookRSSTumblrTwitterPinterest<br />UPCOMING EVENTS<br /><br />‘After Tiller’ Screening And Panel Discussion<br />11.6.2013, Washington, DC<br />WAM!NYC Book Club: Americanah, by Chimamanda Ngozi Adichie<br />11.10.2013, New York City<br />WAM! ON TWITTER<br /><br />RT @juliacsmith: RT @iLuvvit: Why I&#39;m Not Here for  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23WhiteGirlsRock\">#WhiteGirlsRock</a>  | Olivia Cole <a href=\"http://t.co/cQe1u3NjeW\" class=\"ot-anchor\" rel=\"nofollow\">http://t.co/cQe1u3NjeW</a><br />RT @Combat_Jack: You know shit is bad when @SPINmagazine writes a piece on the white washing of Black music and Black radio. Its all fucked…", "plusoners": {"totalItems": 4, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12rgfqwnxjdtd4kc22wzf3adlyti1hut/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12rgfqwnxjdtd4kc22wzf3adlyti1hut/comments"}, "id": "z13gixibdznvudy1t22wcbdawseezjhak04", "objectType": "activity"}, "updated": "2013-11-06T13:03:09.676Z", "actor": {"url": "https://plus.google.com/108482539820581852184", "image": {"url": "https://lh6.googleusercontent.com/-WFToN3NN9iE/AAAAAAAAAAI/AAAAAAAAQ6o/8eBYFuqaUCg/photo.jpg?sz=50"}, "displayName": "Jeff Jones", "id": "108482539820581852184"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/BhKfEssxrLxZ9UUa6VFaaqxP-n8\"", "published": "2013-11-06T13:03:09.676Z", "id": "z12rgfqwnxjdtd4kc22wzf3adlyti1hut"}, "NONE"]