[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "Securing Old Murray Hospital\n\nWith a state of the art Wireless Battery powered security system!\n\nTHE...", "url": "https://plus.google.com/114897286430847258331/posts/gUQ7sr2BwZA", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ktjlguwechtzrf04cgtsyrwyxhvoq044/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-3ZPuCuz6yI4/Ud_OrTitUwI/AAAAAAAAAE4/R4tSsUEr0nA/s0-d/Old%2BMurray%2BHospital.png", "width": 768, "type": "image/jpeg", "height": 744}, "url": "https://plus.google.com/photos/114897286430847258331/albums/5899661275803938049/5899661280254186242?authkey=CPu8g6L5xMPYGA", "image": {"url": "https://lh3.googleusercontent.com/-3ZPuCuz6yI4/Ud_OrTitUwI/AAAAAAAAAE4/R4tSsUEr0nA/w506-h750/Old%2BMurray%2BHospital.png", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "114897286430847258331.5899661280254186242", "objectType": "photo"}], "url": "https://plus.google.com/114897286430847258331/posts/gUQ7sr2BwZA", "content": "Securing Old Murray Hospital<br /><br />With a state of the art Wireless Battery powered security system!<br /><br />THE CHALLENGE: A 200 feet long by 100 feet wide H configuration stone and brick constructed Victorian built two story hospital with internal and external walls in excess of 12 inches. No power and no telephone lines.<br /><br />Security required for main access points and key areas on ground and first floors plus roof security for the entire roof area.<br /><br />No problem for a standard security system, but in this case, there was NO POWER or telephone lines anywhere on the site!<br /><br />Old Murray Hospital in Perth is the 3rd NHS Tayside hospital being mothballed that has employed the new RDAS+ system to secure the property against squatters and metal thieves.  A standard wired or mains powered wireless system was not an option as the building power supply had been terminated and securing the two floors and the roof was a big ask for a battery powered wireless system as it needed to cover roughly 600 Sq. feet over 2 floors and a roof. Not something most battery powered wireless systems could even consider touching until now.<br /><br />Built during Victorian times, the building is of extremely solid construction with internal and external walls of over 12 inches and lots of individual rooms to potentially reduce signal penetration. But that didn’t prevent the RDAS+ from working admirably at the end of the one day install with an average signal strength from detectors to base unit of 60%.<br /><br />Using a total of 6 modified Optex EX35 internal detectors and 8 modified Optex VX402 external detectors for the roof, 2 entry exit detectors and 2 wireless keypads the RDAS+ has provided a highly reliable level of security for this prominent building.<br /><br />Compound Security design and build all their own systems in the UK specifically for purpose, but employ Optex detectors that are modified to communicate with their control equipment. “We do not see the point in trying to develop our own PIRs” says Si Morris, Commercial Director of Compound Security Systems. “some of our competitors have done that, but Optex are the very best at what they do and whilst they are more expensive than most, our customers appreciate the high levels of reliability these detectors provide”.<br /><br />Compound’s systems and stand-alone GPRS and GSM PIRs are used extensively by blue chip clients and the UK police forces as they are easy to deploy and use and provide levels of reliability that results in most systems or stand-alones never needing maintenance visits until the batteries need changing 18 months to 2 years after they are installed.<br /><br />First launched in September 2012, the RDAS+ was designed to exceed the requirements of a Temporary Alarm System laid out in the SSAIB Code of Practice published earlier that year. Si Morris says “The RDAS+ represents a glowing example of UK electronic design and engineering. To give you some idea of the effort that has gone in to this, there are 22 different power modes within the system to maximize battery life as much as possible and the features it offers are impressing a great many people”.<br /><br />Some of the main features of the RDAS+ are:<br /><br />World SIM<br />1KM+ open field range <br />Real time remote Arm/Disarm via secure online portal<br />Full system configuration via secure online portal<br />Full management reporting functions", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ktjlguwechtzrf04cgtsyrwyxhvoq044/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ktjlguwechtzrf04cgtsyrwyxhvoq044/comments"}, "objectType": "note"}, "updated": "2013-07-12T09:40:24.982Z", "actor": {"url": "https://plus.google.com/114897286430847258331", "image": {"url": "https://lh3.googleusercontent.com/-d4Gfr0atkPY/AAAAAAAAAAI/AAAAAAAAAGc/wKMCFxK-MTo/photo.jpg?sz=50"}, "displayName": "Compound Security Systems Ltd", "id": "114897286430847258331"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/c-JRhGlqab3oxLrXh0T2mJq0--w\"", "published": "2013-07-12T09:40:24.982Z", "id": "z12ktjlguwechtzrf04cgtsyrwyxhvoq044"}, "NONE"]