[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "How the price of paint is set in the hearts of dying stars\n\nToday I’m going to try to explain the real...", "url": "https://plus.google.com/107682462662217120755/posts/V2h9A6QCxgD", "object": {"resharers": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nidfjiobfxdmhb04ccpapfxiscrwynac/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh6.googleusercontent.com/-Zlc8Fi8kBQo/UYpt_wB8g-I/AAAAAAAAWIQ/2UF8MUC2PsU/w288-h288/Screenshot%2B2013-05-07%2Bat%2B22.59.48.png", "width": 1906, "type": "image/jpeg", "height": 1260}, "url": "https://plus.google.com/photos/103389452828130864950/albums/5875629602409893409/5875629605850481634?authkey=CKLp_u-N7rrBUw", "image": {"url": "https://lh6.googleusercontent.com/-Zlc8Fi8kBQo/UYpt_wB8g-I/AAAAAAAAWIQ/2UF8MUC2PsU/w506-h750/Screenshot%2B2013-05-07%2Bat%2B22.59.48.png", "width": 506, "type": "image/jpeg", "height": 750}, "content": "Screenshot 2013-05-07 at 22.59.48.png", "id": "103389452828130864950.5875629605850481634", "objectType": "photo"}], "url": "https://plus.google.com/103389452828130864950/posts/EfmdR6VWvRM", "actor": {"url": "https://plus.google.com/103389452828130864950", "image": {"url": "https://lh3.googleusercontent.com/-8H-C8iIWP3g/AAAAAAAAAAI/AAAAAAAAaV0/R3BtB6_j4tA/photo.jpg?sz=50"}, "displayName": "Yonatan Zunger", "id": "103389452828130864950"}, "content": "<b>How the price of paint is set in the hearts of dying stars</b><br /><br />Today I’m going to try to explain the real reason that barns are painted red: nuclear fusion. And yes, this is an excuse to take a mad ride around some of the stranger corners of physics and chemistry in order to give you the <i>real,</i> this-is-not-BS, answer to a simple question.<br /><br />This question got stuck in my head as a result of an episode of a long-forgotten sitcom called <i>Head of the Class,</i> about a high school class full of smart kids. (Sort of like <i>Welcome Back, Kotter</i> in reverse) This being an American show, it’s obligatory to occasionally emphasize the superiority of the ordinary virtue of “plain folk,” so in one episode the protagonists face off in some kind of academic contest with kids from a rural school, and end up losing because their city-slicker knowledge can’t answer the question “why are barns red?” (And this episode appears to have annoyed me enough that, several decades later when I have only the haziest memory of the show’s existence, I still remember it) The answer the show gives is “because red paint is cheaper,” which is absolutely true, but it doesn’t really tell you <i>why</i> red paint is cheaper. Is clearly isn’t because the Central Committee for the Pricing of Paints has decreed that red shall be in vogue this century, or because of the secret Communist sympathies of early American farmers. In fact, to answer this we have to go all the way to the formation of matter itself.<br /><br /><b>Paints &amp; Pigments &amp; The Sun</b><br /><br />First of all, let’s think about what paint is. At a minimum, paint is a combination of a binder (some material that dries to form a film, like acrylic or oil) and a pigment, some material which gives it a color. A pigment is a material which absorbs some colors of light and reflects others; most pigments are minerals. (There are also organic pigments, such as the Imperial Tyrian purple made from the snot of the Murex snail, but not as many, and they tend to be much more expensive for the simple reason that there are a lot more rocks than there are animals and plants.) So for something to be a cheap pigment, it has to be a good pigment, and it has to be cheap. So let’s figure out what makes each of these happen.<br /><br />To be a good pigment, first and foremost, something has to have a nice, bright color. The way pigments produce color is that light shines on them, and they absorb some, but not all, of the colors of light. (Remember that white light is a mixture of many colors of light) For example, red ochre, a.k.a. hematite, a.k.a. anhydrous iron oxide (Fe2O3), absorbs yellow, green and blue light, so the light that reflects off of it is reddish-orange. (This happens to be the pigment that’s used in barn paint, so we’re going to come back to it.) Light is absorbed when a photon (a particle of light) strikes an electron in the pigment and is absorbed, transferring its energy to the electron. But quantum mechanics tells us that an electron can’t absorb just any amount of energy: the particular energies (and therefore colors) that it can absorb depend on the layout of the electrons in the material, which in turn depends on its chemistry.<br /><br />The detailed calculations, or even the not-so-detailed calculations, are way beyond the scope of this post. (There are even whole books about it, like Nassau’s <i>The Physics and Chemistry of Color</i>) But there’s one important pattern which I can at least tell you about, which is that if you look at the various atoms which form a pigment, and you look at their outermost electrons (not the inner electrons, which are so tightly bound to their atom that they don’t participate in chemistry; all of chemistry is determined by the behavior of the outermost electrons around an atom) then it turns out that certain kinds of outermost electrons form pigments, and certain ones don’t.<br /><br />The magic property is what’s called “angular momentum,” which basically measures how fast these outermost electrons are rotating around the nucleus. Electrons in atoms get angular momentum only in fixed increments (there’s that quantum mechanics again, only fixed increments allowed) and for historical reasons, the first few increments are named “s,” “p,” “d,” and “f.” On the periodic table, (<a href=\"http://www.webelements.com/\" class=\"ot-anchor\" rel=\"nofollow\">http://www.webelements.com/</a>) the elements whose outer electrons are “s” form the two tall leftmost columns; the “p” elements are the big square on the right; the “d” elements are the big block in the middle; and the “f” elements are the two rows off at the bottom. (If we ever make element 121, it would be the first “g” element) <br /><br />Electrons with less angular momentum spin in more spherical (rather than deformed) orbits, and when multiple electrons are trying to fly in the same spherical orbit, they repel each other pretty strongly. The result of this is that two “s” electrons meeting will have very different energies -- and it turns out that, in quantum mechanics, the amount of energy an electron can absorb is exactly the <i>difference</i> between these energy levels. So “s” means a big gap, “p” a slightly smaller one, and so on. And it turns out that “d” electrons are right at the sweet spot where that gap corresponds to visible light. <br /><br />Well, why are those particular colors of light visible? It’s because of the temperature of the Sun: our eyes didn’t evolve to see X-rays because there aren’t many X-rays to see around here. Instead, they’re very sensitive in the range of colors that the Sun produces, from red (around 780nm wavelength) to a peak brightness of yellow (around 600nm) all the way up to violet (around 400nm). Those colors correspond to energy gaps of about 0.3 electron volts (eV, a good unit of energy for studying atoms) which are right around the energies of chemical bonds involving d electrons. S- and p- bonds involve energies of 1-3 eV, corresponding to wavelengths around 100nm, in the far ultraviolet range.<br /><br />Did we just get lucky that the Sun is yellow, and if we lived orbiting another star might the useful pigments come from p bonds? Surprisingly, the answer is no. The Sun’s color comes pretty directly from its temperature: it’s literally glowing yellow-hot, with a surface temperature of about 5,800K. The coolest stars, red dwarfs, are about 2,800K and glow red. The hottest stars, the type O stars, go up to about 40,000K, only 72nm; but it turns out that when a star gets any hotter than class F (about 7,000K, about 400nm -- blue) its lifespan starts to decrease precipitously. This is because the temperature of stars is actually fixed by the kinds of fusion reaction going on in their core, which I’ll get back to in a moment, and those hotter reactions burn through their fuel a lot faster. The net result is that any star that’s going to last long enough to have planets with life on them might be a bit redder or a bit bluer than our sun, but not radically so: and it’s those d-orbitals that are going to make the best pigments for anyone whose eyeballs evolved there.<br /><br /><b>How the price of iron is determined in the centers of stars</b><br /><br />So now we know what makes a good pigment. What makes a cheap pigment? Obviously, that it’s plentiful. The red pigment that makes cheap paint is red ochre, which is just iron and oxygen. These are incredibly plentiful: the Earth’s crust is 6% iron and 30% oxygen. Oxygen is plentiful and affects the color of compounds it’s in by shaping them, but the real color is determined by the d-electrons of whatever attaches to it: red from iron, blues and greens from copper, a beautiful deep blue from cobalt, and so on.<br /><br />So if we know that good pigments will all come from elements in that big d-block in the middle, the real question is, why is one of these elements, iron, so much more common than all of the others? Why isn’t our world made mostly of, say, copper, or vanadium?<br /><br />The answer, again, is nuclear fusion. <br /><br />To explain this, we need to think about how fusion actually works. The basic principle is that two small atomic nuclei combine to form a bigger nucleus. Now, there are two forces at work here: there’s an electromagnetic force, which makes the positively-charged nuclei repel each other, and repel each other more and more as they get closer. And there’s the strong nuclear force, which is what holds nuclei together: it’s powerfully attractive, much stronger than the electromagnetic force, but it has the interesting property that it simply shuts off at distances of much more than about 1fm. (10^-15m, the size of a medium nucleus) So to make fusion happen, you need to somehow push two nuclei together with enough force (generally in the form of heat and pressure) to overcome their repulsion until they get within range of the strong force, at which point it will yoink them together with spectacular force and release a good deal of energy in the process.<br /><br />This gives us two rules of thumb. As the nuclei involved get bigger, the amount of energy (heat and pressure, in particular) required to set fusion off gets higher, because you have more repulsion that you have to overcome before fusion can start. And second, as the nuclei get bigger, the amount of energy you get back from the fusion gets <i>smaller:</i> in the bigger nucleus that you would form, you still have all of this repulsion, but the strong force can only bind together the nucleons that are close to each other, so as the nucleus gets bigger you keep adding repulsion but you don’t keep adding attraction. <br /><br />This means that fusion of really small elements is very efficient; combining two hydrogen atoms is just great. (For various technical reasons, the slightly heavier isotopes of Hydrogen -- deuterium (a proton with a neutron) and tritium (a proton with two neutrons) do better than bare protons. That’s where the “D-T” of D-T fusion comes from, and it’s the kind that powers both the Sun and H-bombs.)<br /><br />In fact, once the atoms get too big, you no longer get back <i>any</i> net energy from fusion: the last reactions which turn out to be net-positive are the ones that form atoms with 56 total neutrons and protons in them. Beyond that, fusion starts consuming more energy than it produces, and won’t light up anything. (If you go far enough beyond that, to 232 nucleons or more, you start to see nuclei that are so unstable that a swift kick will make them separate enough that repulsion takes over, and they explode with a bang: that’s nuclear fission, a subject for another time)<br /><br />Now imagine a star. It starts out its life as a giant ball of primordial hydrogen from the formation of the universe, and under the tremendous pressure of gravity, it starts to fuse. As it fuses, it starts to form heavier elements like helium: but (rule 1) it takes higher temperatures than these mere hydrogen fusion temperatures to make helium do any fusing, so the Helium basically acts as a pollutant and just gums up the works. Ultimately, it reduces the efficiency of fusion so much that power levels start to go down.<br /><br />But the only thing holding the star up was the energy of the fusion reactions, so as power levels go down, the star starts to shrink. And as it shrinks, the pressure goes up, and the temperature goes up, until suddenly it hits a temperature where a new reaction can get started. These new reactions give it a big burst of energy, but start to form heavier elements still, and so the cycle gradually repeats, with the star reacting further and further up the periodic table, producing more and more heavy elements as it goes.<br /><br />Until it hits 56. At that point, the reactions simply stop producing energy at all; the star shuts down and collapses without stopping. This collapse raises the pressure even more, and sets off various nuclear reactions which will produce even heavier elements, but they don’t produce any energy: just stuff. These reactions only happen briefly, for a few centuries (or for some reactions, just a few hours!) while the star is collapsing, so they don’t produce very much stuff that’s heavier than 56.<br /><br />If the star is small, it will end up as a slowly-cooling cinder, or as a white dwarf. But if it’s big enough, then this collapse will send shock waves through the body of the star which bounce off the star’s core, pushing the collapsing wall of matter outward with more than enough energy to escape its gravity: the star explodes in a supernova, carrying off a good ⅓ of its total mass, and seeding the rest of the universe with elements heavier than the simple hydrogen we started with. Those elements, in turn, will join the mix for the next generation of stars, as well as the accretion clouds of stuff around them which turns into clumps rather than falling into those stars: that is, the planets. And this is how all of the chemical elements in the universe were formed.<br /><br />How do we know that this is really where the elements came from? There’s a whole field of science around this, but the classic paper is commonly known as “B2FH” for its authors -- Burbidge, Burbidge, Fowler, and Hoyle. Using only the physics and the computational resources available to them in 1957, they calculated all of the various processes by which elements would be formed in stars, in enough detail to predict the ratios of elements which would be formed, and to predict the abundance ratios of chemical elements in our solar system. Amazingly enough, they made a pretty damned good and thorough prediction, enough that even then it was clear that this was a smoking gun -- and it’s been refined considerably since. <br /><br />So how does this tie in to red paint? Well, I told you before that the magic cutoff for ordinary fusion is at 56 nucleons. Because it’s the last point in the normal reaction chain, a lot of the fusion products tend to “build up” there before the star explodes, and so you get a lot more of isotope 56 than you do of anything except for the really light elements that didn’t fuse at all, or didn’t fuse much. (Check out the first figure in the B2FH paper, linked below) And what has 56 nucleons in it and is stable? A mixture of 26 protons and 30 neutrons -- that is, iron.<br /><br />So it’s because of the details of nuclear fusion -- the particular size at which nuclei stop producing energy -- that iron is the most common element heavier than neon. And as we saw before, you have to be a d-block element to make a decent pigment, which means that iron is going to be, by far, the most plentiful pigment for any species which lives on a star that isn’t about to blow up. And it’s going to bond to oxygen, the most plentiful thing around in planetary crusts for it to bond to (only hydrogen and helium are more common, and they tend to evaporate), to form iron oxides: those rich, red ochres that we mix with oils to form a cheap, stable, red paint.<br /><br />And that’s why barns are painted red.<br /><br /><br />To learn more:<br />Something a lot more interesting than you would guess: <a href=\"http://en.wikipedia.org/wiki/Paint\" class=\"ot-anchor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Paint</a><br /><a href=\"http://en.wikipedia.org/wiki/Pigment\" class=\"ot-anchor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Pigment</a><br />The color of the Sun: <a href=\"http://en.wikipedia.org/wiki/Sunlight\" class=\"ot-anchor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Sunlight</a><br />Colors of stars, and a place to start about how they get them: <a href=\"http://en.wikipedia.org/wiki/Main_sequence\" class=\"ot-anchor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Main_sequence</a><br />The abundance of elements in the universe, the Earth, the human body, and other places:<br /><a href=\"http://en.wikipedia.org/wiki/Abundance_of_the_chemical_elements\" class=\"ot-anchor\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Abundance_of_the_chemical_elements</a><br />The 1980’s sitcom that inspired this: <a href=\"http://www.imdb.com/title/tt0090444/\" class=\"ot-anchor\" rel=\"nofollow\">http://www.imdb.com/title/tt0090444/</a><br /><br />To learn a lot more about color:<br /><a href=\"http://www.amazon.com/Physics-Chemistry-Color-2nd/dp/0471391069\" class=\"ot-anchor\" rel=\"nofollow\">http://www.amazon.com/Physics-Chemistry-Color-2nd/dp/0471391069</a><br />To learn a lot more about how the elements are formed, the original B2FH paper: <a href=\"http://rmp.aps.org/pdf/RMP/v29/i4/p547_1\" class=\"ot-anchor\" rel=\"nofollow\">http://rmp.aps.org/pdf/RMP/v29/i4/p547_1</a><br /><br />Photo by John Christopher: <a href=\"http://www.flickr.com/photos/67382043@N06/6153955066/\" class=\"ot-anchor\" rel=\"nofollow\">http://www.flickr.com/photos/67382043@N06/6153955066/</a>", "plusoners": {"totalItems": 11, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nidfjiobfxdmhb04ccpapfxiscrwynac/people/plusoners"}, "replies": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nidfjiobfxdmhb04ccpapfxiscrwynac/comments"}, "id": "z13kjdkr2tjtzjqul233gdehdkrqinlb304", "objectType": "activity"}, "updated": "2013-05-08T19:59:32.087Z", "actor": {"url": "https://plus.google.com/107682462662217120755", "image": {"url": "https://lh4.googleusercontent.com/-plLhzESWerg/AAAAAAAAAAI/AAAAAAAAQYU/ogf9omNangc/photo.jpg?sz=50"}, "displayName": "Alvin Stearns", "id": "107682462662217120755"}, "annotation": "<b>Simple (when explained, as admirably done here) and great  fun.</b> Circle the author.", "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/DYgk5MEHUunEheq_79h34tUzpJY\"", "published": "2013-05-08T19:59:32.087Z", "id": "z12nidfjiobfxdmhb04ccpapfxiscrwynac"}, {"items": [{"inReplyTo": [{"url": "https://plus.google.com/107682462662217120755/posts/V2h9A6QCxgD", "id": "z12nidfjiobfxdmhb04ccpapfxiscrwynac"}], "kind": "plus#comment", "plusoners": {"totalItems": 1}, "object": {"content": "I learn something new everyday on g+.", "objectType": "comment"}, "updated": "2013-05-08T20:42:13.338Z", "actor": {"url": "https://plus.google.com/113231828920921397345", "image": {"url": "https://lh5.googleusercontent.com/-ytl50tt6MlI/AAAAAAAAAAI/AAAAAAAAA5I/iabRiOJnBYY/photo.jpg?sz=50"}, "displayName": "Mike McQueen", "id": "113231828920921397345"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/GZ0IxgR-HNJ8j_DsCo5flgG7Am0\"", "published": "2013-05-08T20:42:13.338Z", "id": "z12nidfjiobfxdmhb04ccpapfxiscrwynac.1368045733338697", "selfLink": "https://www.googleapis.com/plus/v1/comments/z12nidfjiobfxdmhb04ccpapfxiscrwynac#1368045733338697"}], "kind": "plus#commentFeed", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/xbq-WxOx60vdXs57wwMysPtUSt4\"", "title": "Google+ List of Comments for an Activity"}]