[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "St. Rose of Lima had a tender love and confidence in the Mother of God, reciting daily 15 decades of...", "url": "https://plus.google.com/109406424058081237905/posts/KAQc15BMXEz", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ltdei5w3bypmng23hhrcr3zbhxdtoq04/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-TIOIRing4TI/UinoCU-1drI/AAAAAAAAKRw/mYU6S8-jDnQ/1235931_508093825943342_740751412_n.jpg", "width": 435, "type": "image/jpeg", "height": 750}, "url": "https://plus.google.com/photos/109406424058081237905/albums/5920518308308962401/5920518311844869810?authkey=CKvjtPfQhYTrkgE", "image": {"url": "https://lh3.googleusercontent.com/-TIOIRing4TI/UinoCU-1drI/AAAAAAAAKRw/mYU6S8-jDnQ/w506-h750/1235931_508093825943342_740751412_n.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "109406424058081237905.5920518311844869810", "objectType": "photo"}], "url": "https://plus.google.com/109406424058081237905/posts/KAQc15BMXEz", "content": "St. Rose of Lima had a tender love and confidence in the Mother of God, reciting daily 15 decades of the Rosary and the Little Office of the Blessed Virgin which was the tradition of the Dominican Third Order to give special honour and render these praises to the Immaculate Virgin on behalf of the whole Order.<br /><br />It was during a vision during one of her many ecstasies that Rose saw the Blessed Virgin holding out to her the child Jesus who spoke to Rose in this simple words, “Rose of My heart, be thou My spouse !”<br /><br />Not knowing what Religious community she should join but encouraged by the local bishop to join a new community of Augustinian Nuns, Rose went to the Rosary altar of the Dominican church in order to bid Our Lady farewell; but, as she was about to leave the church, she found that she was unable to move from the spot, nor could the gigantic efforts of her brother, who had accompanied her, avail. Then the idea flashed across her mind that this was our Blessed Lady’s method of showing her that she was to remain in the world as a Dominican Tertiary. No sooner had this devoted client of Mary made this decision than she was released by this mysterious force and permitted to return home. From that moment she accepted the black and white habit of St Dominic and was admitted as a novice into the Third Order, in that very same Rosary chapel. <br /><br />She spent her Dominican life working for the poor and destitute of Lima while entrusting all her work to the Blessed Virgin. She promoted among the same poor of Lima, the daily recitation of the Rosary and the Litany of the Virgin Mary, gaining many devoted clients of the Queen of Heaven. Ahead of her days like the modern times she wore the Rosary around her neck like St. Martin, unashamed of her servitude to the Blessed Mother and reminding all those to whom she ministered that a servant of Mary is truly a servant of Christ.<br /><br />May St. Rose give us the strength and courage to bear witness to the power of the Rosary, the service of the Blessed Virgin and to promote it in our modern world.<br /><br />Pic: Our Lady of the Rosary, St. Dominic and St. Rose of Lima.", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ltdei5w3bypmng23hhrcr3zbhxdtoq04/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ltdei5w3bypmng23hhrcr3zbhxdtoq04/comments"}, "objectType": "note"}, "updated": "2013-09-06T14:34:58.149Z", "actor": {"url": "https://plus.google.com/109406424058081237905", "image": {"url": "https://lh4.googleusercontent.com/-vk69dNQsgLU/AAAAAAAAAAI/AAAAAAAAAC0/vP9iqXh_C9s/photo.jpg?sz=50"}, "displayName": "The Crusade Prayer Group", "id": "109406424058081237905"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/xrDrB9WGko18C8wx56Fv9V-EYEw\"", "published": "2013-09-06T14:34:58.149Z", "id": "z12ltdei5w3bypmng23hhrcr3zbhxdtoq04"}, "NONE"]