[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": " Produce Conscious #estacy \nWhen The mortal #breath   disappears scientifically from the lungs, We consciously...", "url": "https://plus.google.com/106367651170401745304/posts/JcESD3QL5MF", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13bid5wzyagejcnd220zdlovkjuihxjq04/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-WTuq6QZqFXc/UWDQlefZnHI/AAAAAAABUww/KunE-iWLnUs/w288-h288/Babaji.jpg", "width": 220, "type": "image/jpeg", "height": 282}, "url": "https://plus.google.com/photos/106367651170401745304/albums/5863916053105575697/5863916057094888562?authkey=CJ_129DIxe-Fdg", "image": {"url": "https://lh3.googleusercontent.com/-WTuq6QZqFXc/UWDQlefZnHI/AAAAAAABUww/KunE-iWLnUs/w506-h750/Babaji.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "Babaji.jpg", "id": "106367651170401745304.5863916057094888562", "objectType": "photo"}], "url": "https://plus.google.com/106367651170401745304/posts/5TNuT1LgCqV", "actor": {"url": "https://plus.google.com/106367651170401745304", "image": {"url": "https://lh3.googleusercontent.com/-gVJmJni1qSU/AAAAAAAAAAI/AAAAAAAB6jI/g2_QcKHzZT0/photo.jpg?sz=50"}, "displayName": "Walter Karas", "id": "106367651170401745304"}, "content": " Produce Conscious  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23estacy\">#estacy</a>  <br />When The mortal  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23breath\">#breath</a>   disappears scientifically from the lungs, We consciously experiences, without dying, the death process by which energy is switched off from the senses causing the disappearance of the body consciousness and the simultaneous appearance of the  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23soul\">#soul</a>   consciousness<br />.<br />We again realizes that his life is not conditioned by exhalation and inhalation, but that the steady life force in the  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23brain\">#brain</a>   is continuously reinforced through the  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23medullafrom\">#medullafrom</a>   the omnipresent  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23cosmic\">#cosmic</a>   current.<br />.<br />Even mortal  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23man\">#man</a>   during the nightly state of sleep rises psychologically above the consciousness of breath; his life force then partially becomes still and reveals a glimpse of the soul as the deep joy of sleep. The breathless yogi, however, realizes the state of conscious &quot;  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23death\">#death</a>    &quot; as a far deeper and more blessed state than that bestowed by the deepest blissful semi-superconscious sleep. When breath ceases, he is suffused with an incomparable bliss. He realizes then that it is the storm of human breath that is responsible for the creation of the dream wave of the human body and its sensations; it is breath that causes body consciousness.<br /><br />St. Paul said I protest by our rejoicing which I have in Christ  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23jesus\">#jesus</a>   our Lord, I  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23die\">#die</a>   daily.St. Paul was able by life-force control to dissolve the consciousness of his dream body into the everlasting rejoicing of the  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23christ\">#christ</a>   Consciousness.<br /><br />.<br />When with cessation of breath and the quieting of the heart the life force is switched off from the senses, the mind becomes detached and interiorized, able at last to perceive consciously the inner astral worlds and supernal spheres of divine consciousness.<br /><br />In the first stages of ecstasy ,We perceives the soul blessedness. By higher ecstasies that come as a result of complete mastery of the breathless state, he realizes the physical body to be made of life trons that are surrounded by a halo of grosser electroatomic cells,<br />We perceives the illusion of the body dream de materialize into the reality of God. By experiencing the reality of the body as prana or life trons, controlled by the thought of god , We  becomes one with Him. With that divine consciousness that we is able to create, preserve, or de materialize the dream atoms of his body or of any other object in creation. Attaining this power, the yogi has the option of leaving his physical dream body on earth to gradually disintegrate into cosmic  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23atoms\">#atoms</a>    ; or he can keep his dream body on earth indefinitely like Babaji; or, like Elijah, he can de materialize its dream atoms into the Divine Fire. Elisha witnessed the body of  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23elijah\">#elijah</a>   become etheric, ascending in a chariot of fiery atoms and life trons commingled with the cosmic light of God. His luminous physical and astral dream bodies and his causal body and soul merged into Cosmic Consciousness.<br />&#39;<br />The  <a class=\"ot-hashtag\" href=\"https://plus.google.com/s/%23lord\">#lord</a>   surrounded man&#39;s soul first with an idea body. Then He encased the idea body with a very fine or subtle light (the astral body. The third or final encasement was the electroatomic dream body, the illusion of a fleshly form. ", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13bid5wzyagejcnd220zdlovkjuihxjq04/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13bid5wzyagejcnd220zdlovkjuihxjq04/comments"}, "id": "z13cjpi5dw2ecpocu220zdlovkjuihxjq04", "objectType": "activity"}, "updated": "2013-08-31T16:24:08.257Z", "actor": {"url": "https://plus.google.com/106367651170401745304", "image": {"url": "https://lh3.googleusercontent.com/-gVJmJni1qSU/AAAAAAAAAAI/AAAAAAAB6jI/g2_QcKHzZT0/photo.jpg?sz=50"}, "displayName": "Walter Karas", "id": "106367651170401745304"}, "annotation": "Breath...Breathing,,,,, Like filling a vase Pranayama<br>Pran is a subtle invisible force high valence ion charged oxygenated air air is the life-force that pervades the body. It is the factor that connects the body and the mind, because it is connected on one side with the body and on the other side with the mind. It is the connecting link between the body and the mind. The body and the mind have no direct connection. They are connected through Pran only.<br>pūrak to take the breath inside, kumbhak to retain it, and rechak to discharge it<br>Breathwork has been used as a label for yogic Pranayama and Tibetan Tantric Tummo, traditional spiritual practices from which the modern Western therapies most probably derive. Occasional use of the term Breathwork to describe Buddhist Anapanasati, “mindfulness of breathing” or &quot;conscious breathing&quot; appears to be misleading, because the meditator breathes naturally, without attempting to change the length or depth of the breath, simply observing it. This too can be debated as some practitioner would contend that whenever attention is focused and the object of attention changes, in this case breathing typically becomes longer, deeper and more relaxed<br>.<br>Breathing is the process that moves air in and out of the lungs Aerobic organisms  require oxygen to release energy via respiration, in the form of the metabolism of energy-rich molecules such as glucose. Breathing is only one process that delivers oxygen to where it is needed in the body and removes carbon dioxide. Another important process involves the movement of blood by the circulatory system. Gas exchange occurs in the pulmonary alveoli by passive diffusion of gases between the alveolar gas and the blood in lung capillaries. Once these dissolved gases are in the blood, the heart powers their flow around the body via the circulatory system. The medical term for normal relaxed breathing is eupnea.<br>In addition to removing carbon dioxide, breathing results in loss of water from the body. Exhaled air has a relative humidity of 100% because of water diffusing across the moist surface of breathing passages and alveoli.", "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/JEEV30lcYAPAsKrxbiGW8sr-HrQ\"", "published": "2013-08-31T16:24:08.257Z", "id": "z13bid5wzyagejcnd220zdlovkjuihxjq04"}, "NONE"]