[{"kind": "plus#activity", "provider": {"title": "Community"}, "title": "Peace Of The Silence\nPosted on May 2, 2012 by Osho Times\nPeace In Silence\nThis peace is not dead, it...", "url": "https://plus.google.com/103533940201142045358/posts/3sqZYFECgMk", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12vzhlrwnzmebacl22gynoatmzytbbmy/people/resharers"}, "attachments": [{"displayName": "Osho Rajneesh", "fullImage": {"url": "https://lh3.googleusercontent.com/-V_80pO4GBJc/UmYR6kJ2nTI/AAAAAAAADMA/u5rzQlW-uqg/w1130-h869/osho.rajneesh.jpg", "width": 1130, "type": "image/jpeg", "height": 869}, "url": "https://plus.google.com/photos/103533940201142045358/albums/5937452852890992209/5937452856569666866?sqi=106430100260390673064&sqsi=b969b703-6427-4549-baf1-54a29096b202", "image": {"url": "https://lh3.googleusercontent.com/-V_80pO4GBJc/UmYR6kJ2nTI/AAAAAAAADMA/u5rzQlW-uqg/w506-h750/osho.rajneesh.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "osho.rajneesh.jpg", "id": "103533940201142045358.5937452856569666866", "objectType": "photo"}], "url": "https://plus.google.com/103533940201142045358/posts/3sqZYFECgMk", "content": "Peace Of The Silence<br />Posted on May 2, 2012 by Osho Times<br />Peace In Silence<br />This peace is not dead, it is not flat.<br /><br />The most difficult thing in your life — which should really be the easiest — is to sit by the side of the flow of your mind. Your mind is just like a river. Thoughts and thoughts and a crowd of thoughts go on passing. You simply sit by the bank, unconcerned, just a witness, and you are in for a great surprise.<br /><br />Slowly slowly, as you become more and more centered and simply a witness, thoughts start disappearing. They can exist only with your identification.You give energy to your mind. When you pull yourself out, you have stopped giving nourishment to the mind. And once there is no nourishment — thoughts are very fragile things — they start dying out.<br /><br />Soon there is silence, there is peace. And this peace is not the peace of a cemetery. This peace is not dead, it is not flat. It is such a tremendous experience that once you have reached the first rung of the ladder, the ladder goes to infinity. You can go on and on discovering new layers of peace. This is the real excitement, unending excitement. That’s the meaning of the word “ecstasy”: unending excitement. You cannot exhaust it, you cannot come to a point where you say, “There is no more to discover and I am feeling flat.” It has never happened. On my own authority I say to you, I have been going as fast as possible, deeper and deeper into silence, but there is no bottom, there is no limit.<br /><br />Each moment of silence brings new fragrance. Peace brings new flowers. Nothing is said, but much is heard. Nothing is shown, but much is seen. Nobody guides you, but some magnetic force of peace itself takes you farther and farther away from the mind, from the body, from the neighbors, from the wife, from the husband. And the excitement is continuously deepening.<br /><br />Unless we can create millions of people around the earth who have experienced this kind of peace, war is inevitable, because people cannot survive flat lives. It is better to go into a war and have a little excitement, although it means death.<br /><br />If a man who has not known inner peace is forced to live peacefully, he will either murder or kill himself. Even that will provide some excitement. Excitement is a great nourishment, but only the right kind of excitement is nourishment. The wrong kind of excitement is poison. And up to now humanity has been dominated by the wrong kind of excitement.<br /><br />You are here with me to learn a very simple thing: to enjoy peace, to enjoy silence, to enjoy something that is within you and you do not have to depend on others for.<br />source :  <a href=\"http://oshoonline.in\" class=\"ot-anchor\" rel=\"nofollow\">oshoonline.in</a>", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12vzhlrwnzmebacl22gynoatmzytbbmy/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12vzhlrwnzmebacl22gynoatmzytbbmy/comments"}, "objectType": "note"}, "updated": "2013-10-22T05:49:35.926Z", "actor": {"url": "https://plus.google.com/103533940201142045358", "image": {"url": "https://lh5.googleusercontent.com/-PGwBm72uCOk/AAAAAAAAAAI/AAAAAAAAAXg/H92H25_4RRI/photo.jpg?sz=50"}, "displayName": "mayank soni", "id": "103533940201142045358"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Meditation Osho (Discussion)"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/Wd3t41qMuTqvyCNlfax8BPPegEQ\"", "published": "2013-10-22T05:49:35.926Z", "id": "z12vzhlrwnzmebacl22gynoatmzytbbmy"}, "NONE"]