[{"kind": "plus#activity", "provider": {"title": "Google+"}, "title": "iIngenico Modernizes In-Store Payment Solution for Caché, Inc:\n\nIngenico a worldwide provider of payment...", "url": "https://plus.google.com/101888574268182256288/posts/19Ycz9kP5yZ", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z130gdfq0yv3xyw0kyaactoreramjpes1/people/resharers"}, "attachments": [{"displayName": "Woman with shopping cart, close up", "fullImage": {"url": "https://lh3.googleusercontent.com/-EthuJI0OyD4/UneW4RVeGnI/AAAAAAAACjQ/mYr7POL7avY/w642-h500/ingenico%2B4-11-2013.jpg", "width": 642, "type": "image/jpeg", "height": 500}, "url": "https://plus.google.com/photos/101888574268182256288/albums/5942384118032267505/5942384126808955506", "image": {"url": "https://lh3.googleusercontent.com/-EthuJI0OyD4/UneW4RVeGnI/AAAAAAAACjQ/mYr7POL7avY/w506-h750/ingenico%2B4-11-2013.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "ingenico 4-11-2013.jpg", "id": "101888574268182256288.5942384126808955506", "objectType": "photo"}], "url": "https://plus.google.com/101888574268182256288/posts/19Ycz9kP5yZ", "content": "iIngenico Modernizes In-Store Payment Solution for Caché, Inc:<br /><br />Ingenico a worldwide provider of payment solutions announced that Cache, Inc., a mall-based integrated lifestyle women’s apparel retailer, has selected Ingenico to modernize its in-store payment acceptance and customer check-out experience.<br /><br />The Ingenico iSC 350 Signature Capture point of sale device has been designed to support retailer’s payment solution with a large color display and a powerful secure processor. Combined with Caches applications such as loyalty or promotions, Ingenico provides Caché with unique multi-media brand building capabilities and acceptance of additional forms of payment, which significantly expands consumers’ payment choices at checkout, including EMV chip cards, contactless, and NFC-based mobile payments.<br /><br />“Cache’s customers are confident and fashion-conscious. When shopping in any of our 250 boutique stores, they are looking for a fashion-forward product mix as well as a unique experience with our brand. Our goal is to differentiate Caché stores from other mall-based retailers at every possible point of engagement including point-of-sale,” said Anthony DiPippa, Executive Vice President, Chief Financial Officer, Caché.<br /><br />“By choosing to equip our current in-store payment acceptance infrastructure with Ingenico’s iSC 350 multimedia capable devices, we are seeking to provide a way to connect with our loyal customers. This move will also give us the ability to drive conversion rates by introducing impactful brand marketing and tailored promotions at the point of sale.”<br /><br />“Our innovative and flexible POS solution enables Caché to reduce its operational complexity, and to further facilitate convergence between payment and business applications,” said Thierry Denis, President, Ingenico North America. “The device allows Caché to highlight in-store specials with targeted ads, drive branding programs, and display coupons. Also, our solution allows Caché to securely enroll customers in its loyalty programs, sell or reload gift cards, and cross-sell additional merchandise if they decide to do so.”<br /><br />Ingenico and Cache have already successfully deployed more than 400 iSC 350 devices throughout Caché’s 250 stores in the United States.", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z130gdfq0yv3xyw0kyaactoreramjpes1/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z130gdfq0yv3xyw0kyaactoreramjpes1/comments"}, "objectType": "note"}, "updated": "2013-11-04T12:45:30.791Z", "actor": {"url": "https://plus.google.com/101888574268182256288", "image": {"url": "https://lh4.googleusercontent.com/-87COAb6vVpo/AAAAAAAAAAI/AAAAAAAAAIk/uFbwM1_nnAg/photo.jpg?sz=50"}, "displayName": "QTEC LLC", "id": "101888574268182256288"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/HdwMC9EvptTNIG941qfjQYZu9QA\"", "published": "2013-11-04T12:45:30.791Z", "id": "z130gdfq0yv3xyw0kyaactoreramjpes1"}, "NONE"]