[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "LOVE IN THE ABSOLUTE WORLD:\nby His Divine Grace A.C. Bhaktivedanta Swami Srila Prabhupada\n\nSrila Prabhupada...", "url": "https://plus.google.com/108422886526326881497/posts/NcozezD273p", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z131wnpw4sn1zxbo104cfpngvrfod1sgo0o/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh4.googleusercontent.com/-v47YJ-OzNGk/UlWHlDaJDfI/AAAAAAAAA1A/WQ5H5GJf4Is/302637_210275709105076_1467469455_n.jpg", "width": 426, "type": "image/jpeg", "height": 480}, "url": "https://plus.google.com/photos/106759139455510722441/albums/5932797151216270833/5932797154770357746", "image": {"url": "https://lh4.googleusercontent.com/-v47YJ-OzNGk/UlWHlDaJDfI/AAAAAAAAA1A/WQ5H5GJf4Is/w506-h750/302637_210275709105076_1467469455_n.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "302637_210275709105076_1467469455_n.jpg", "id": "106759139455510722441.5932797154770357746", "objectType": "photo"}], "url": "https://plus.google.com/106759139455510722441/posts/N3i7hNvWv1B", "actor": {"url": "https://plus.google.com/106759139455510722441", "image": {"url": "https://lh5.googleusercontent.com/-8n5IG2A7HcE/AAAAAAAAAAI/AAAAAAAAAzM/j1KSKXFjB9I/photo.jpg?sz=50"}, "displayName": "\"BACK TO GODHEAD\" ARTICLES", "id": "106759139455510722441"}, "content": "LOVE IN THE ABSOLUTE WORLD:<br />by His Divine Grace A.C. Bhaktivedanta Swami Srila Prabhupada<br /><br />Srila Prabhupada<br />As long as we have the desire for material sense gratification or the desire for material liberation there is no possibility of developing transcendental bliss in Krsna consciousness. Bhukti is the desire for material sense gratification, and mukti is the desire, after being frustrated, for liberation. Real mukti or liberation however, means to achieve devotional service. If one becomes liberated from nonsense then one must engage oneself in something which is tangible. Otherwise it is not possible to stop one&#39;s material sense gratificatory activities. To make the mind void of engagement in the material world by intoxication or by forgetting with drugs is artificial. One must be completely free from material engagement. That freedom can be possible. To give a material example, if one fills up a glass with milk, then there is no possibility of the glass&#39;s filling up with ink. It is our choice whether to fill up the glass with ink or milk. But if we simply empty the glass of ink and d not fill it up, or if we have no knowledge how to fill the glass with milk, then naturally, in an inky atmosphere, there is the possibility that it will again become filled with ink. Even if we empty the glass of ink, if we have no better quality of liquid with which to fill the glass, then it well be prone to being filled with ink again. Therefore, this impersonal void philosophy does not stand. It is simply negation. Impersonalists wish to cease material activities, but if they do not take on positive, spiritual activity, then they will fail because they will not be able to control their minds.<br /><br />In the Bhagavad-gita it is stated that the mind cannot be vacant even for a second. The mind must accept something and reject something. Either one is accepting something or rejecting something but one cannot make the mind void. And even if one is able to do so that voidness will not stand. If one has nothing good to think then one will have to think of all nonsense. And when we fill up our minds with Krsna consciousness we will not be distracted by material sense gratification or material liberation.<br /><br />Fill The Mind With Krsna<br /><br />There is transcendental bliss in Krsna consciousness. But transcendental bliss cannot be conceived as long as one&#39;s mind is not completely vacated of material sense gratification. This process of emptying the mind of material engagement and filling it with spiritual engagement can be practiced. Caitanya Mahaprabhu says that one has to follow the regulative principles. A man who is diseased has to follow the regulative curative principles, and gradually his fever decreases, and he is cured. Similarly, one must adopt the means by which one can fill one&#39;s mind with Krsna consciousness, and gradually the mind&#39;s engagement in material consciousness will disappear. This is the process of devotional service. If one is always engaged in some sort of service in Krsna consciousness, then there will be no chance for material consciousness to enter the mind. Therefore I insist that when my students are not engaged in Krsna consciousness work, then they must simply chant Hare Krsna, Hare Krsna. That is also engagement. Twenty-four hours a day, even in sleeping or even in working, our minds should be always full with Krsna consciousness: then there will be no chance for material consciousness to enter, and that will make us perfect.<br /><br />The Object Of Love<br /><br />When one sincerely struggles to fill the mind with Krsna consciousness and drive away material consciousness, then one gradually develops the mature condition of love of Godhead. The mind is attracted by so many so-called loving affairs in the material world that it is very difficult to drag the mind from this so-called love and transfer the love to God or Krsna. Love exists, of course, in everyone. I want to love. That is my instinct. But if I have no object of love which will permanently exist, then I will have to apply myself to an object which will ultimately perish. This is called sat and asat. Sat means that which will exist, and asat means that which will not exist. Matter will cease to exist, but spirit will exist and is existing eternally. Our bodies are matter, so if we place our love in connection with these bodies, then our love will cease to exist. It will be frustrated, either during this life or the next life; it will be frustrated because matter will not exist eternally. How can your love exist eternally? Everyone has love, so if we practice how to direct our love toward Krsna, then gradually our temporary love for so many different objects will be transferred to Krsna, and our eternal life and the propensity of love will continue.<br /><br />The Practice: Bhakti<br /><br />Now we are trying by regulative principles to transfer our minds to Krsna consciousness. In that mature condition, one achieves love of God. Love of God does not mean theoretical knowledge and book writing. People say, &quot;We have trust in God; we have love for God,&quot; and yet they engage in all sorts of nonsense. This will not do. Rather, one must practice so that one will love others. Bhakti means devotional service. Krsna consciousness means realization of God. The symptom of realization of God is that as soon as one is in touch with God or Krsna, one will have no more taste for material things. This is the test. If one is free of disease, one will have no more fever, and one&#39;s pulse will be normal. Similarly, if one is actually advanced in Krsna consciousness, the concomittant result will be that one will lose one&#39;s interest in material consciousness. One can test for oneself whether one is advancing. If one is advancing in Krsna consciousness, then his taste for material consciousness will decrease. If one gives a hungry man foodstuffs, the more he goes on eating, the more strongly he feels satisfaction. He can understand, &quot;I am eating something.&quot; And when he has actually filled his belly with foodstuffs, then even if one offers him a golden sweetball, he will not accept it. He is filled up; he does not want any more. Dhruva Maharaja went to search out God in order to get the kingdom of his father, but when he actually found God he said. &quot;My dear Lord, I do not want anything.&quot;<br /><br />It is confirmed in Bhagavad-gita that if one actually attains Krsna consciousness, then any other gain or profit will be most insignificant. That is satisfaction. Krsna consciousness will give one peace. This is called self-realization. It is not gained by smoking marijuana or ganja. By intoxication one may be able to forget material nonsense for the time being, but as soon as the hallucination is gone, one must again come back. For example, one can travel 50,000 miles high by spacecraft, but what are 50,000 miles? There are millions and millions of miles in outer space! Unless one gets the shelter of another planet, one will have to come back again to this planet. We want shelter. To be situated in the sky-voidness will not give one satisfaction. The astronauts are trying again to go to the moon or other planets. It is not that they are trying to wander in outer space. Their aim is to go to the moon; they are looking for tangible shelter.<br /><br />As for spiritual life, as long as one does not get that ultimate shelter, he will have to come back again. Simply voidism or impersonal negation of this material consciousness will not help. One must have positive consciousness; then one can stop. Therefore,Srimad-Bhagavatam says, &quot;My dear Lord, there are persons who speculate that they have become free.&quot; Vimukti-manina means the concoction of thinking that one has become free when actually one is not free. One may go up 20,000 or 50,000 miles and think, &quot;Now I am out of this world,&quot; but that is not out of the world. Similarly, those who are speculating mentally &quot;Now I am free.&quot; are not actually free. They are thinking, &quot;I am out of this earthly sphere,&quot; but they are not because their intelligence is not yet purified. And why are they not purified? The Bhagavatam says, &quot;They have neglected Your personality.&quot; Because they are impersonalists, they have no shelter. Those who are thinking in an impersonal way have no entrance into the Krsna planet. Their intelligence is not purified. The result is that even though they go very high, almost to the concept of Brahman realization, because there is no engagement in the service of the Lord, they will come teach again and engage themselves in philanthropic service and altruistic service, such as opening hospitals and doing humanitarian work, and so they fall down.<br /><br />First of all they say, &quot;The world is false, and the Absolute Truth is truth,&quot; and they try to realize the Absolute Truth. But because they have not truly realized the Absolute Truth, they therefore come back again to that false world which they have denied. So what is the value of their humanitarian work? If they say that this world is false, then why do they take to humanitarian work? It is because they do not have genuine realization of the Absolute Truth. If they say that the world is false, then why do they take to material service, social science? Why take to it if it is false? It is because they have no other engagement that they have to take to this false engagement. Therefore the Bhagavatam states, &quot;Their intelligence is not purified because they have no shelter.&quot;Bhagavad-gita confirms this: &quot;Therefore, when one&#39;s intelligence is purified after many, many births of the speculative habit of searching after the Absolute Truth, one then surrenders.&quot; Mental speculators say that they want peace in the world, but they will not believe in God. This was nicely stated by the Archbishop of Canterbury, who said, &quot;You want the kingdom of God without God.&quot; They will say that God is dead, that there is no necessity of God, and that God has played so much havoc. They will decry God, and with their limited power they will try to establish peace and prosperity among humanity. But how is it possible? The example can be given that if one doesn&#39;t pour water on the root of a tree but simply waters the leaves and twigs, the entire tree will die. That is not the natural process. Similarly, if one doesn&#39;t supply foodstuffs to one&#39;s stomach but simply washes one&#39;s body with soap to make it clean, it will die; it will cease to exist. So we have to take to the root. Vedanta-sutra says, janmadyasya yatah:Brahman is He from whom everything is coming. Caitanya Mahaprabhu says, &quot;If one gives up the prime source of emanation, if one gives up the root, and if one simply hovers by mental concoction, then where is the possibility of transcendental bliss&#39;?&quot; There is no possibility. One must engage oneself in the regulative principle of devotional service in Krsna consciousness, and then gradually the material disease will be cured, and one will be established in complete Krsna consciousness, and that will give one blissful eternal life.<br /><br />Somehow Or Other, Surrender:<br /><br />If one surrenders in some way or other to Krsna, Krsna will not let him go. Sri Rupa Gosvami says, &quot;Somehow or other, just try to apply your mind to Krsna. Never mind what you are, what you are doing or what your position is it doesn&#39;t matter. Simply try to apply your mind to Krsna; then everything will follow.&quot; Krsna is not subject to any conditions. It is not that one can go to Him only after becoming qualified. There is no such necessity. Material qualifications have no value. In the material world we calculate, &quot;This is good, and this is bad.&quot; But actually nothing is good, and nothing is bad it is all illusion. In illusion where is there goodness or badness? Illusion is illusion.<br /><br />In the Bhagavad-gita it is said that even a slight application of the principle of Krsna consciousness delivers a person from the greatest danger. What is that greatest danger? The greatest danger is our material existence. Repeatedly we take birth, and repeatedly we meet death. This is the greatest danger. People do not understand it. They do not know on which platform they are standing. This material platform is the greatest danger. It is compared to a forest fire: samsara-davanala-lidha-loka. Actually, anywhere we go we see that there is always fire. The fire brigade is always running this way and that way. However we try to keep our material existence peaceful and prosperous by artificial means, there is no possibility of peace and prosperity in the material world. We must understand that it is always full of danger. One who becomes serious about his position knows: &quot;I am not in a very steady or fixed up position; my position is very tottering. I am standing on a tottering platform.&quot; This is the actual beginning of spiritual life.<br /><br />Love Is Our Life:<br /><br />Once we begin spiritual life, we can find real enjoyment. Caitanya Mahaprabhu has explained that our real life is love of Godhead. Love is our life; everyone wants to love. Everyone is hankering to love someone. But we do not know where to place our love. Krsna, however, is the ultimate object of love. We are trying to maintain this body, but the body is not actually the proper object of our love. Rather, it is the life within the body that is the real object of love. Similarly, the central point is Krsna. As soon as we somehow or other place our love with Krsna, our path of happiness, eternity and bliss opens. If we gradually make progress, then we actually reach the platform of love, and then other symptoms of love become manifested. Caitanya Mahaprabhu has explained how love in the pure transcendental stage of life develops with Krsna, and He has divided it into five relationships: santa, dasya, sakhya, vatsalya and madhurya.<br /><br />These categories differ according to progressive affection for God, but the basic principle of all of them is love of God. Santa means the neutral position. This is the sublime position of knowing that God is great. When there is appreciation of God but there is no activity, that is called the neutral stage, santa-rasa. But when activity is added, one concludes, &quot;God is the greatest, so let me render some service to the greatest.&quot; It is quite natural. Suppose one is with a person who is one&#39;s superior. Naturally one says, &quot;Mr. Such and Such, can I do something for you?&quot; This offering of service is natural. Whenever one finds some superior, one will naturally offer one&#39;s service.<br /><br />Simply understanding that God is great is the principle of all religious scriptures, whether Christian or Jewish or Hindu or Muslim. The common conception of all religion is that God is very great. The Muslims say, &quot;Allah agavat.&quot; The Christians say, &quot;God is great.&quot; The Hindus say, &quot;Satyam param brahman.&quot; When Arjuna understood Bhagavad-gita and understood Krsna also, he addressed Krsna as param brahman, the greatest spiritual identity. The acceptance of the greatness of God is called santa-rasa. It is also peaceful realization: &quot;I have realized the greatest.&quot; This is called brahma-bhuta. &quot;I am qualitatively one with the Supreme. I am Brahman, and the Lord is also Brahman.&quot; Suppose a very big man is our very nearest and dearest relative. Are we not proud of it? For example, wouldn&#39;t you feel proud to know that the President were your uncle? Similarly, as soon as one understands that he is Brahman or that Krsna is Param Brahman, he will feel ecstasy. That is called santa-rasa.<br /><br />The next stage is when one feels, &quot;Why not render some service to the President? I want to do something for him.&quot; A great man has a great field of activities; if one offers some service to the Supreme Lord, one has an unlimited field. One can worship the Supreme Lord by one&#39;s talent. Everyone has some specific talent; even birds and beasts have specific talents. When Lord Ramacandra was constructing a bridge over the Indian Ocean to approach the kingdom of Ravana, Hanuman and the other big monkeys were bringing big stones, and a spider also concluded, &quot;Why not serve Ramacandra?&quot; They were trying to construct a bridge, and the spider thought, &quot;What can I do?&quot; So he started rubbing his legs in the dust and throwing bits of dust into the ocean. Hanuman said, &quot;What nonsense are you doing?&quot; The spider replied, &quot;I am doing some service.&quot; And Ramacandra said, &quot;He is doing as good as you are. You are throwing big stones, but he has no power to bring big stones. He is doing whatever he has the power to do, so he is doing as well as you.&quot; This shows that God does not require any service from us. He is complete, but He wants to see our existence engaged in giving pleasure to the Supreme.<br /><br />Many people ask, &quot;Why did God create us?&quot; The answer is that God created us for enjoyment. Why does a father create so many children? For enjoyment. Otherwise, what is the use of taking so much responsibility for a family? Nowadays people don&#39;t want to take any responsibility, but people try to evade it. It is a fact, however, that by not being family men they are unhappy. Everyone should be responsible; no scripture disallows family life. Anyone can serve the Supreme Lord.<br /><br />The Unlimited Enjoyer<br /><br />Srila Prabhupada<br />The Lord has created all these living entities for His enjoyment. Why has He created so many? Because He is unlimited, and His aspiration for enjoyment is also unlimited. Therefore He can produce unlimited children, and there is an unlimited possibility for enyoyment with God. This is God consciousness. Don&#39;t think that if a few people enter into the abode of Krsna, it will become congested and overpopulated. There is no question of overpopulation. That is nonsense. God has the capacity to maintain everyone because He is unlimited. We are not suffering due to overpopulation. It is due to our godlessness that nature inflicts suffering upon us and we are therefore suffering. Fruit is produced for human beings, and if there is overpopulation, nature can profusely produce more fruit. It has the power. But if we are not God conscious, Krsna conscious, nature can reduce, and then we have poverty. Any production depends on nature, and so nature will supply. For example, in a prison house the prisoners sometimes are not supplied the proper food. Why? Is the government unable&#39;&#39; No. But the government feels that the criminals should be punished. So when there is poverty, when there is scarcity, one should know that it is not due to overpopulation; it is due to our godlessness.<br /><br />In India they are thinking that technology will save them. But technology will not save them. They have committed a great mistake; they have killed their own culture of God consciousness. In Berkeley there was a meeting, and an Indian girl asked me, &quot;Swamiji, what is God?&quot; So that is their punishment. I told her, &quot;You claim that you are an Indian girl, and you do not know what God is. The birthplace of God is India; Krsna appeared there, Lord Ramacandra appeared there, Lord Caitanya appeared there, and you claim to be Indian, and you do not know. How degraded you have become.&quot; It is due to our degradation that we suffer, otherwise there is no scarcity in the kingdom of God. The kingdom of God can be immediately established here also, if we are Krsna conscious.<br /><br />The Srimad-Bhagavatam describes the great prosperity of the government of Maharaja Yudhisthira. It is even stated that there was no excessive heat or excessive cold in his kingdom, and there was no anxiety among the people. Not only were there foodstuffs in abundance, but no one was in physical anxiety. There was no enmity; there was not even severe cold or severe heat. These miseries are punishment. When we feel severe cold or severe snowfall, this is punishment. One can observe that in some of the cold parts of the world there are Eskimos living in houses of ice and eating raw flesh and blood, and yet maya has so much power that they are thinking, &quot;We are happy.&quot; If they did not think themselves happy, they couldn&#39;t live there. Therefore the conditions are created in such a way that even a worm in the stool also thinks, &quot;I am happy.&quot; The hog who is eating stool also thinks, &quot;I am happy. I am getting fat.&quot; Unless one feels happy, he cannot get fat. This is psychology. Eating will not make one fat. When one thinks, &quot;I am quite all right,&quot; he will get fat. The hog is thinking, &quot;I am happy.&quot; The worm in the stool is thinking, &quot;I am happy.&quot; The Eskimos are thinking, &quot;I am happy.&quot; But who is actually happy? No one is happy. There is no happiness in this material world.<br /><br />When one gets out of the so-called happiness of material life and becomes conscious that God is great, that is called santa-rasa. And when one tries to offer some service to the Supreme Lord, then there is much one can do because this is a civilization of godlessness. If one engages one&#39;s body, mind, words, intelligence and talent for propagation of this Krsna consciousness, then one&#39;s dasya-rasa attitude of rendering service to the Lord will be nicely developed. In Bhagavad-gita the Lord says, &quot;Anyone who is trying to broadcast the Bhagavad-gita&#39;s message of Krsna consciousness is very dear.&quot; Those rascals who are trying to curb down Krsna while at the same time teaching from the Bhagavad-gita are doing the greatest disservice, and they will have to suffer for that. They preach only their own concocted philosophy, not the real thing. But if anyone actually preaches Bhagavad-gita as it is, he becomes the dearmost person. The example is given that if one pleases one&#39;s stomach, then automatically all parts of one&#39;s body will be pleased. Similarly, God, Krsna, is the center; He is the stomach of all manifestations. If we give Him our service, then He will be pleased, and the whole world will be pleased and the whole world will be peaceful and prosperous. Krsna consciousness is very scientific. Try to please Krsna. If one pours water onto the roof of a tree, all the branches, leaves, flowers and twigs become nourished, and if one supplies foodstuffs to one&#39;s stomach, the nourishment is distributed all over the body. Similarly, if one wants peace and prosperily, then one should begin devotional service immediately.<br /><br />Santa-rasa is to realize that God is great. Every religion says that God is great, but in the Vedic scriptures we find how to render service to the Lord. That we won&#39;t find in any other scripture. Simply to understand that God is great is very nice, but that understanding of greatness will not stand if one does not apply oneself practically in service. That science is taught in the Bhagavad-gita and Srimad-Bhagavatam. Therefore Krsna consciousness is not a sectarian religion. The example is given regarding the pocket dictionary and the international dictionary. A pocket dictionary is undoubtedly a dictionary, and the huge Webster&#39;s International Dictionary is also a dictionary. But the two dictionaries are not the same, although both of them are dictionaries. Similarly, there are many scriptures and many religious principles all over the world. No human society is without religious principles. But here is the International Dictionary, Bhagavad-gita and Srimad-Bhagavatam. So don&#39;t take it as a sectarian thing. It is international, universal. One should study Bhagavad-gita and Srimad-Bhagavatam in that spirit, not in the sectarian spirit.<br /><br />Lord Caitanya has therefore described the five different kinds of attraction. The first is santa, neutral attraction. When the affection increases more, it becomes servitude; when it increases still more, it becomes parental love; and when it finally increases to the highest degree, it is called conjugal love. These things are possible in our relationship with Krsna in the transcendental world. The basic ingredient is love of Godhead. The example of degrees of sweetness was nicely given by Lord Caitanya to illustrate this principle: molasses, when sweetened, becomes sugar, and when sugar is further concentrated, it becomes rock candy. Also, when we analyze the material elements, we find that from ether, air is produced; from air, fire is produced; from fire, water is produced; from water, earth is produced; and in the earth one will find all other elements. If one analyzes earth one will find ether, fire, air, and water, but in the water there is no earth in the fire there is no water, in the air there is no fire, and in the ether there is no air. This is scientifically true. Similarly, in the transcendental world, our relationship with Krsna can be further and further developed. It. can be developed unlimitedly. In the spiritual world the spirit souls are enjoying unlimitedly. There is no misery there, and all is full of joy, eternal bliss and eternal knowledge. Everyone there is relishing his particular relationship with Krsna, and everyone is satisfied in that particular relationship. One may say that friendship is better than servitude, but in the transcendental world there are no such differences. Whether friendship, servitorship, parental love or conjugal love, the transcendental bliss is fully derived.<br /><br />Secondary Relationships<br /><br />There are seven secondary relationships with Krsna. Hiranyakasipu, for example, was killed by an incarnation of the Lord, Nrsimhadeva, for the sake of his son. It is very difficult to understand the absolute nature of the Supreme Lord: to be killed by Him is another mellow. Hiranyakasipu is an eternal associate of Krsna, but Krsna wanted to fight. We cannot make God a stereotype He is the most dynamic force. When Krsna wants to fight, He fights. Sometimes kings keep wrestlers and they mock fight. Similarly, when Krsna desires to fight, then He has to fight with His devotee. If Krsna desires to have a mother, then one of His devotees becomes His mother. If Krsna wants a wife, then one of the devotees becomes His wife. He is full, but at the same time He has unlimited desires. Don&#39;t think that Krsna has no desire. With that desire, He has become many. Sometimes we take pleasure in fighting. We make fighting parties; some friends form one party, and other friends form an opposite party, and they fight. That is enjoyment, not fighting. Similarly, the killing of a devotee by Krsna is also a sporting pastime. In the absolute world there is no such thing as discrimination, yet every variety exists.<br /><br />The secondary as well as the primary relationships relished by Krsna and His devotees are described in The Nectar of Devotion. When the relationship between Krsna and His devotee is joking, it is called hasa-rasa. Another relationship is that ofadbhuta, wonder. Hiranyakasipu was struck with wonder at the form of Nrsimhadeva, half-lion and half-man. He did not know whether the form was an animal or man or God or a demigod. This is called adbhuta, being struck with wonder. There is also another reciprocation vira, chivalry, as in the fighting between Bhisma and Arjuna. Bhisma was taking pleasure in piercing Krsna with arrows. Blood was oozing from Krsna&#39;s body, and ultimately He took a wheel and presented Himself before Bhisma: &quot;I have taken the weapon. Just see!&quot; The description of Bhisma&#39;s worshiping Krsna by fighting appears in the First Canto of Srimad-Bhagavatam. It is not that Krsna can be worshiped only by offering flower garlands. A devotee also has the power to love Krsna by piercing His body. Otherwise it is not complete. The impersonalists cannot enter into the kingdom of completeness. There is eternal bliss in fighting with Krsna and in seeing Krsna bloodstained. That is described in this scene from the Bhagavatam.Bhisma enjoyed seeing Krsna with His hair covered with the dust kicked up by the horses on the battlefield. Krsna was in anxiety that His devotee Arjuna would be killed. He appeared disturbed and perspiring, while at the same time Bhisma was piercing I km with arrows. That scene was remembered by Bhisma: &quot;I want to see that Krsna.&quot; This is reciprocation. Hiranyakasipu wanted to see Krsna as an enemy, and therefore he began to torture His own son so that Krsna would come as His enemy and kill him.<br /><br />Other relationships were displayed when Krsna appeared as a gigantic boar form in the sky to deliver the earth. At that time the earth planet had fallen in the mire of the nether world, and all the demigods prayed to Krsna to get it out. When features such as ghastliness, astonishment, wonder, anger and dread are displayed in different pastimes of the Lord, these are not direct relations, but are indirect. In the absolute world, however, there is no difference between the feature of wonder or the loving feature of Krsna embracing Radharani or Krsna playing with the damsels of Vraja. There is no such difference in the absolute world.<br /><br />For purposes of calculation, there are a total of twelve different relationships with Krsna. Out of the twelve, five are primary, and the seven others are secondary. But there is no difference between the primary and secondary relationships. We should always remember that this is the Lord&#39;s absolute variety. This transcendental variety is always absolute, and so there is no difference. That is not to be understood on the material platform because here there is antagonism in the variety, but in the spiritual world there is no antagonism. Everything is relishable.", "plusoners": {"totalItems": 6, "selfLink": "https://www.googleapis.com/plus/v1/activities/z131wnpw4sn1zxbo104cfpngvrfod1sgo0o/people/plusoners"}, "replies": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z131wnpw4sn1zxbo104cfpngvrfod1sgo0o/comments"}, "id": "z13vihri3uqetzunx22yjn5jvlqqgvw1y", "objectType": "activity"}, "updated": "2013-11-04T12:36:17.277Z", "actor": {"url": "https://plus.google.com/108422886526326881497", "image": {"url": "https://lh3.googleusercontent.com/-65PQpuy4AXI/AAAAAAAAAAI/AAAAAAAAA-c/ILa0oFx13jw/photo.jpg?sz=50"}, "displayName": "Aksh Sudarsh", "id": "108422886526326881497"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/8HjI8owUm_23sNh8wNK8ga8Nk1Q\"", "published": "2013-11-04T12:36:17.277Z", "id": "z131wnpw4sn1zxbo104cfpngvrfod1sgo0o"}, {"items": [{"inReplyTo": [{"url": "https://plus.google.com/108422886526326881497/posts/NcozezD273p", "id": "z131wnpw4sn1zxbo104cfpngvrfod1sgo0o"}], "kind": "plus#comment", "plusoners": {"totalItems": 0}, "object": {"content": "Jay ho radha kirsan ki!", "objectType": "comment"}, "updated": "2013-11-04T13:53:00.852Z", "actor": {"url": "https://plus.google.com/102949043780077235124", "image": {"url": "https://lh6.googleusercontent.com/-eplzQzxKm1o/AAAAAAAAAAI/AAAAAAAABGE/wbHyGGEm5YM/photo.jpg?sz=50"}, "displayName": "M.K.Sonawane. Mahadev.", "id": "102949043780077235124"}, "verb": "post", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/l3FudnltaqUkrlzKU2Pe0yogMow\"", "published": "2013-11-04T13:53:00.852Z", "id": "z131wnpw4sn1zxbo104cfpngvrfod1sgo0o.1383573180852989", "selfLink": "https://www.googleapis.com/plus/v1/comments/z131wnpw4sn1zxbo104cfpngvrfod1sgo0o#1383573180852989"}], "kind": "plus#commentFeed", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/yDg89S_JXm7I7rNkWCqrhB5RVmI\"", "title": "Google+ List of Comments for an Activity"}]