[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "What THINK YE of CHRIST? Whose Son is he?\n\nISLAM has already told the world what THEY think the answer...", "url": "https://plus.google.com/110020178455758982455/posts/HZTLAL84Pgq", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nh3xr3qfaf5033235sbnzaq3ud3dlb/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh5.googleusercontent.com/-ZZ8PMaCK2uc/UjijJhb3xbI/AAAAAAAAZTQ/KV-d65LYjP0/AC.jpg", "width": 300, "type": "image/jpeg", "height": 377}, "url": "https://plus.google.com/photos/100302133262254344211/albums/5924664676860901153/5924664693795308978?authkey=CO2elOTZ0_vhuQE", "image": {"url": "https://lh5.googleusercontent.com/-ZZ8PMaCK2uc/UjijJhb3xbI/AAAAAAAAZTQ/KV-d65LYjP0/w506-h750/AC.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "100302133262254344211.5924664693795308978", "objectType": "photo"}], "url": "https://plus.google.com/100302133262254344211/posts/7cT9CY3aFxz", "actor": {"url": "https://plus.google.com/100302133262254344211", "image": {"url": "https://lh4.googleusercontent.com/-hw_euOcNZ6U/AAAAAAAAAAI/AAAAAAAAABk/zJXGd5-GyfM/photo.jpg?sz=50"}, "displayName": "Walter Kambulow", "id": "100302133262254344211"}, "content": "What THINK YE of CHRIST? Whose Son is he?<br /><br />ISLAM has already told the world what THEY think the answer is to this question! “Jesus NOT Son of God. He is A Prophet of ISLAM!” Do you SEE and COMPREHEND THIS? &quot;...every spirit that CONFESSETH NOT that Jesus CHRIST [the Messiah; the Son] is come in the FLESH IS NOT OF GOD: and THIS IS THAT SPIRIT OF ANTICHRIST&quot; (1 John 4:3)!<br /><br />ISLAM, to your FACE, is calling the apostle Peter A LIAR, when Peter told Jesus, “…we BELIEVE and are SURE that thou art THAT CHRIST, THE SON OF THE LIVING GOD” (John 6:69)! Islam’s “god” HAS NO SON!<br /><br />We know WHAT the followers of Islam THINK, but, the way YOU answer this question found in Matthew 22:42 will DETERMINE where YOU spend eternity – with God, OR in the Lake that BURNETH with fire and brimstone!<br /><br />The YOUNG PEOPLE (ages 10-50) of this generation are ALREADY in danger of their souls, being driven to MADNESS thanks to ORGANIZED RELIGION, which is immersed in their own HYPOCRISY, and their GREED FOR GAIN. Young people sit back and WATCH their parents and other adults “GROVELLING IN ADMIRATION” after these FALSE PREACHERS and TEACHERS!<br /><br />But, no matter WHAT the circumstances, EVERYONE IS RESPONSIBLE for their OWN SOUL! The SIN-question has been settled. Jesus settled it, once, for all, FOREVER, “For by ONE OFFERING he hath PERFECTED FOREVER them that are SANCTIFIED” (Hebrews 10:14) by faith.<br /><br />Jesus was GOD IN FLESH, “…reconciling the world unto Himself” (2 Cor. 5:19). Salvation has been BROUGHT DOWN to man and presented in Christ Jesus; but unless you THINK RIGHT about CHRIST, you CANNOT BE SAVED!<br /><br />Jesus told the religious leaders and the people of his day, “…IF YE BELIEVE NOT that I am HE [that is, CHRIST...], ye shall DIE IN YOUR SINS” (John 8:24).<br /><br />Debate, discussion, controversy, and division FOLLOWS JESUS wherever he is preached, as surely as sunset follows the sunrise. To his disciples, Jesus said, “THINK NOT that I am come to SEND PEACE ON EARTH: I CAME NOT to send peace, but a SWORD.<br /><br />“For I am come to SET A MAN AT VARIANCE AGAINST his father, and the daughter AGAINST her mother, and the daughter in law AGAINST her mother in law.<br /><br />“And a man’s FOES shall be THEY of his OWN household” (Matt. 10:34-36).<br /><br />Family members and friends are TORN APART because of the WORDS of the Son of God! But Jesus said, “Blessed are ye, when MEN [male and female] shall SEPARATE YOU FROM THEIR COMPANY, and shall REPROACH YOU [to defame; to rail at; to chide; to taunt], and CAST OUT [to eject] your name as EVIL, for the Son of man’s sake” (Luke 6:22).<br /><br />Today, belief in CHRIST JESUS is dropping exceedingly, and RIGHTLY SO! After the church is GONE, the “man of sin” (2 Thes. 2:3) will reveal himself, and declare himself that he is “God.” And the “LIE” that the world will believe, is that “GOD HAS NO SON,” therefore a MASS REJECTION of the gospel of Christ will take place, and &quot;...CAST DOWN THE TRUTH to the ground&quot; (Daniel 8:12)! <br /><br />“SEARCH THE SCRIPTURES; for IN THEM YE THINK YE have eternal life” (John 5:39), but instead you are “EVER LEARNING, and NEVER ABLE to come to the knowledge of the TRUTH” (2 Tim. 3:7)!", "plusoners": {"totalItems": 1, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nh3xr3qfaf5033235sbnzaq3ud3dlb/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12nh3xr3qfaf5033235sbnzaq3ud3dlb/comments"}, "id": "z12bypnq0zemulktb22nczfhiru0zbc2n", "objectType": "activity"}, "updated": "2013-11-09T10:12:43.274Z", "actor": {"url": "https://plus.google.com/110020178455758982455", "image": {"url": "https://lh4.googleusercontent.com/-BOZ5-aa8ACY/AAAAAAAAAAI/AAAAAAAAgMY/XXMpH9lY8GQ/photo.jpg?sz=50"}, "displayName": "madhu gattineni", "id": "110020178455758982455"}, "annotation": "What think of ye Jesus Christ. Whatever you think.... He is God in Human form . He has done so many Miracle while He was on earth. He made the Dead to live, He got power over Death, Sin, devil , Diseases and  the Nature. He conquered Death .He is the wisest one and nobody spoke like him at any time.  His birth , Death and resurrection were predicted by Prophets well in advance before His Birth on this earth.What more qualities you need to prove somebody as God. Is there anybody equal to Him in living a sinless life ,Power to cure many diseases , performing Miracles, the message in Teachings at anytime. All these things prove that He is The Lord of all. He is far more above than any Prophet / messenger so far born on the surface of this earth. He is the true example and a role model that anybody can safely and happily  follow because he is pure, Sinless , Holy and very powerful.If we follow any human being who is sinful, unholy, we will end up in hell with Him. So Jesus is the one and only way for all the people in this world to follow and to enable them to go to Heaven.except Him there is no other way to go to Heaven and all others/ other ways lead us to Hell...  So Jesus is The Lord of all.... Madhu Gattineni, Toronto, Canada", "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/gOEbMwZxe1ETXLisq1x24RXUtXY\"", "published": "2013-11-09T10:12:43.274Z", "id": "z12nh3xr3qfaf5033235sbnzaq3ud3dlb"}, "NONE"]