[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": "FEAR GOD\nWhy don't we hear much talk of our need to fear the Lord anymore?  There used to be a time ...", "url": "https://plus.google.com/100356535254562110603/posts/R4KzZDodt1a", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13asv2glmewtluoj04civ2ibrnryjozg3s/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh3.googleusercontent.com/-o9EOEPseUvM/Umk3exXLPYI/AAAAAAAAOFM/u6Jz6HqZBbw/the-fear-of-the-lord.jpg", "width": 552, "type": "image/jpeg", "height": 745}, "url": "https://plus.google.com/photos/105992896676933056578/albums/5938338585278024369/5938338585450855810", "image": {"url": "https://lh3.googleusercontent.com/-o9EOEPseUvM/Umk3exXLPYI/AAAAAAAAOFM/u6Jz6HqZBbw/w506-h750/the-fear-of-the-lord.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "the-fear-of-the-lord.jpg", "id": "105992896676933056578.5938338585450855810", "objectType": "photo"}], "url": "https://plus.google.com/105992896676933056578/posts/LgtAZaNBGKJ", "actor": {"url": "https://plus.google.com/105992896676933056578", "image": {"url": "https://lh3.googleusercontent.com/-anh9KQY6BTE/AAAAAAAAAAI/AAAAAAAAALU/3eDlwmm5hAE/photo.jpg?sz=50"}, "displayName": "lara stang", "id": "105992896676933056578"}, "content": "<br />FEAR GOD<br />Why don&#39;t we hear much talk of our need to fear the Lord anymore?  There used to be a time when we spoke of someone who was a God-fearing woman or man and we had admiration and respect for them, instead of casting them off as the weirdos in society. Sadly, God is not feared anymore and I believe that is why our country is in such a disastrous mess.<br /><br />There are many examples in the Bible about men collapsing to the ground unable to even look in the presence of God because of their deep fear of Him.  Even in the new Testament not just the old.  In Acts we see two people who were killed instantly by God for lying. This caused great fear in those who witnessed it.  Jesus lashed out in anger to the den of thieves working in His Fathers house of worship causing panic.<br /><br />When we experience the revelation of Christ our knowledge of God increases and we develop a deep respect, awe, and fear of the Lord.  The first instance of this fear was written about in the garden of Eden.  They feared God after they disobeyed Him.  Fear of God is essential to a persons relationship with Him.  It is not just being in awe of God but also a feeling of dread.  When we acknowledge how great and pure and righteous our Lord is and how impure and sinful and weak we are; it will not be hard to fear Him.<br /><br />God is love but He is also righteous, holy, and just.  We need to never forget that and should never be ashamed to speak of it.  To leave that part out is making a false god or idol of your own.  I believe if our country were to get the fear of God back into it there could be a much needed revival.<br /><br />Our faith in the powerful Almighty God living within us should never cause us to fear those false religions and their hateful false gods who are out to destroy God&#39;s people and rule the world.  God will never allow that to happen because His Kingdom trumps all others. In these last days I believe there will be an increase of the indwelling of the Holy Spirit for the glory of Christ who reigns in the heavens and among us today.<br /><br />I pray for all my beloved brothers and sisters in Christ always to put the fear of God before any worldly fear such as these foolish false gods, wicked religions, and wicked people doing evil acts to the innocent we see and hear about too often today.  The victory has already been won.  They can&#39;t touch our eternal promises and God will destroy them.  We are victorious over the enemy because of our faith in the Lord Jesus Christ who lives in us.   AMEN!<br />~Lara Stang<br />October 24, 2013", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13asv2glmewtluoj04civ2ibrnryjozg3s/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z13asv2glmewtluoj04civ2ibrnryjozg3s/comments"}, "id": "z130stzh2vuodlqnp22lt5fjcvq4w5oan04", "objectType": "activity"}, "updated": "2013-10-25T03:25:08.834Z", "actor": {"url": "https://plus.google.com/100356535254562110603", "image": {"url": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg?sz=50"}, "displayName": "Ralph Smith", "id": "100356535254562110603"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/P5F40HY5Sw53mK7nzkbxMJ2IT6g\"", "published": "2013-10-25T03:25:08.834Z", "id": "z13asv2glmewtluoj04civ2ibrnryjozg3s"}, "NONE"]