[{"kind": "plus#activity", "provider": {"title": "Reshared Post"}, "title": " Antonino Zichichi about evolutionism,atheism and creationism  !\n\n\"There is no scientific discovery ...", "url": "https://plus.google.com/108340299003793397423/posts/aXh1eMmLXNT", "object": {"resharers": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ahvzbywiqwniqc04cf345ypj5wveohfk/people/resharers"}, "attachments": [{"fullImage": {"url": "https://lh4.googleusercontent.com/-yBM3w09Hdy4/UiZnU_goK1I/AAAAAAAAKWI/mIF8cZaFWIQ/zichichi.jpg", "width": 305, "type": "image/jpeg", "height": 450}, "url": "https://plus.google.com/photos/102687906821325695642/albums/5919532363296924625/5919532370568424274?authkey=CLiA543K9uDPjgE", "image": {"url": "https://lh4.googleusercontent.com/-yBM3w09Hdy4/UiZnU_goK1I/AAAAAAAAKWI/mIF8cZaFWIQ/w506-h750/zichichi.jpg", "width": 506, "type": "image/jpeg", "height": 750}, "content": "", "id": "102687906821325695642.5919532370568424274", "objectType": "photo"}], "url": "https://plus.google.com/102687906821325695642/posts/KM4AY9ekQ3i", "actor": {"url": "https://plus.google.com/102687906821325695642", "image": {"url": "https://lh4.googleusercontent.com/-XQVst_fIO4g/AAAAAAAAAAI/AAAAAAAACqY/1ddDYb3L6SY/photo.jpg?sz=50"}, "displayName": "Gionata Flamigni", "id": "102687906821325695642"}, "content": " Antonino Zichichi about evolutionism,atheism and creationism  !<br /><br />&quot;There is no scientific discovery that could be used in order to put in doubt or deny the existence of God.<br />It is therefore not correct to say that Atheism has as its foundation the great achievements of Mathematical Logic and Science.<br />Atheism starts from the denial of the transcendent and entrusts all his credibility to the logical rigor Immanent. This logical rigor in the Immanent means Mathematics and Science. Neither the one nor the other can prove that God does not exist. The atheist said he could not believe in God for logical rigor. Furthermore, the atheist knows only one type of logical rigor: that which operates in the Immanent. But the logical rigor in the Immanent fails to prove that God does not exist. Here is the antinomy of Atheism.<br />Atheism is far from a logical construction comparable in severity to that which requires the Mathematical Logic. Let us assume it to be. The day when atheism was at the height of its rigor, it would be like to Mathematical Logic. Therefore Atheism can never prove that God does not exist. Yet the cornerstone of atheism is the non-existence of the Transcendent taking as rigorous logical structure in the Immanent the most perfect man to be able to build, the theorem that there must be no God no one knows prove.<br />This headlong rush does not alter the conclusion that today Atheism is a logical construction contradictory.<br />The total lack of connection between Atheism and logical structures in the Immanent. The link between immanent and transcendent does not lead to any contradiction, since theology has never entered into conflict with either the Mathematical Logic nor with the discoveries of Galilean science.<br />The achievements of science do not obscure the divine laws, but strengthen, helping to awaken the wonder and admiration for the wonderful spectacle of the Cosmos, which goes from the heart of a proton to the edge of the universe. No scientific discovery has questioned the existence of God Science is a source of values ​​that are in communion, not in contrast with the teaching of Holy Scripture. No atheist can then hope to be more logical and scientific of him who believes. Those who choose Atheism is therefore an act of faith: in the Void.<br />The greatest achievement of science is the discovery that a rigorous logic rules the world. This logic no one can deduct from Chaos. So there must be the author. The research depends on this logic: &quot;if we were children of Chaos could not exist in the scientific laboratories which continues to decipher the&quot; Book of Nature. &quot; If the Science ceases to continue to decipher what is written in the book of the Creator goodbye new technological inventions .&quot; <br />( ANTONINO ZICHICHI  , 1999 )", "plusoners": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ahvzbywiqwniqc04cf345ypj5wveohfk/people/plusoners"}, "replies": {"totalItems": 0, "selfLink": "https://www.googleapis.com/plus/v1/activities/z12ahvzbywiqwniqc04cf345ypj5wveohfk/comments"}, "id": "z12kyxvgwqnrulpvh23mureoxtief14ze04", "objectType": "activity"}, "updated": "2013-10-24T10:04:25.030Z", "actor": {"url": "https://plus.google.com/108340299003793397423", "image": {"url": "https://lh3.googleusercontent.com/-b-vsrtjvh5g/AAAAAAAAAAI/AAAAAAAAACo/WMnPrn_PoCM/photo.jpg?sz=50"}, "displayName": "Antonella Russo", "id": "108340299003793397423"}, "access": {"items": [{"type": "public"}], "kind": "plus#acl", "description": "Public"}, "verb": "share", "etag": "\"Mwea3qudNDf-hWWlPWi3n-YrU1Q/r-bvknyhM9wM_rD6wKk57W08HIQ\"", "published": "2013-10-24T10:04:25.030Z", "id": "z12ahvzbywiqwniqc04cf345ypj5wveohfk"}, "NONE"]